{
    "bi_grams": "[DIRECTOR FINANCE, FP&A Executive, Executive Profile, senior finance, finance leader, working closely, executive team, removing obstacles, targeted growth, continually search, things better, senior leadership, finance teams, enhanced analytics, dynamic reporting, reporting tools, Skill Highlights, Forecasting Accounting, Accounting Financial, Financial Analysis, Reporting Strategic, Strategic Financial, Financial Planning, Planning Operations, Operations Management, Management Data, Data Development, Development Process, Process Improvement, Improvement Functional, Functional Integration, Integration Budget, Budget Creation, Creation Tool, System Development, Development Team, Team Building, Management System, System Integrations, Integrations Cost, Cost Control, Control Mergers, Acquisitions Project, Project Management, Management Turnarounds, Restructurings International, International Hyperion, Hyperion Essbase, Hyperion Enterprise, Enterprise Hyperion, Hyperion Retrieve, Retrieve MS, MS Access, Access MS, MS Excel, Excel MS, MS PowerPoint, PowerPoint MS, MS Word, Word FileMaker, FileMaker Minitab, Minitab Storm, Storm WordPerfect, WordPerfect 4D, 4D FAS, Strategen AccPac, AccPac BOSS, BOSS Business, Business Objects, Objects Daly, Wolcott Great, Great Plain, Plain Dynamics, Dynamics Lawson, Lawson MacPac, MacPac OneGlobe, OneGlobe Oracle, PeopleSoft QuickBooks, QuickBooks SAP, SAP Magnitude, Magnitude TMS, TMS nSIMMS, nSIMMS Monarch, Monarch Razorsight, Razorsight Sage, Sage SQL, SQL Strategen, Strategen Small, Small business, business development, development Project, Project management, management Leadership, communication skills, skills Business, Business operations, operations organization, organization Budgeting, Budgeting expertise, expertise Self, motivated Customer, oriented Professional, Professional Experience, Experience Director, Director Finance, State A.T., A.T. Cross, year tradition, crafting fine, fine writing, writing instruments, private equity, equity firm, firm held, held $, M global, global company, prior CFO, dynamic finance, finance function, company transitioned, Major Achievements, A.T. Cross, enhanced global, global budget, budget tool, delivered budget, product sku, sku level, level utilizing, utilizing advanced, advanced MS, MS Access, A.T. Cross, independent ERP, ERP systems, consolidation process, day close, capital investment, investment required, created robust, robust modeling, reporting tool, tool utilizing, utilizing advanced, advanced MS, MS Excel, MS Access, Access skills, skills allowing, detailed analysis, transaction level, existed postponing, M capital, capital expense, years Prior, planned implementation, working closely, sales leadership, develop KPI, KPI reporting, reporting dashboard, lead tracking, tracking tool, drive revenue, revenue growth, saving $, $200K., 200K. Co, leading supply, supply chain, chain review, review initiative, initiative including, including evaluation, supply chain, working capital, capital KPI, Creating modeling, modeling tools, led effort, improve product, product costing, costing practices, Senior Finance, Finance Consultant, State Engaged, period ranging, Granite City, City Electric, owned company, Sun Life, Life Financial, Saint Gobain, hold interim, interim senior, senior finance, finance roles, work closely, executive teams, Major Achievements, robust ERP, ERP systems, inventory database, track existing, existing store, store assets, enabling real, cost planning, planning related, proposed changes, changes improving, improving efficiency, predictive capabilities, multiple global, global ERP, ERP systems, Saint Gobain, executive team, menu- driven, driven reporting, reporting tool, created utilizing, utilizing Business, Business Objects, advanced Excel, VBA increasing, increasing analytical, analytical capabilities, key metric, metric analysis, Senior Finance, Finance Director, high capacity, capacity communications, communications services, private equity, equity firm, firm held, held company, company bought, Lightower Fiber, Fiber Networks, $2B, finance team, executive team, Con Ed, Ed Solution, RCN Communications, Major Achievements, sales efforts, maintaining margins, analysis tool, contract review, approval process, processes performed, MS Excel, monitored individually, sales pricing, pricing database, cost identification, identification database, foster improved, improved sales, sales decisions, bringing finance, technical operations, formalized review, Telecommunications expenses, expenses represent, total operating, operating expenses, accurate tracking, timely payment, customer impacting, impacting costs, circuit inventory, inventory tracking, tracking database, facilitate accurate, accurate cost, cost analysis, network outage, outage rate, year period, estimated annual, annual savings, Global Engagement, Mobility Solutions, Solutions Manager, State Worldwide, Worldwide Director, publicly traded, traded global, global $, $3.5BM, 3.5BM company, company providing, providing management, technology consulting, consulting services, large companies, governmental institutions, led finance, finance function, function supporting, supporting deployment, consulting resources, international borders, serve global, global clients, driving compliance, international immigration, social tax, tax laws, Major Achievements, Facing substantial, substantial fines, possible discontinuation, external tax, tax advisors, immigration providers, Country Controllers, Corporate Tax, Tax Department, Payroll Department, finance team, process design, accounting related, subsidiary countries, tracking database, accounting tool, tool saving, saving millions, lost revenues, publicly traded, traded $, global enterprise, enterprise networking, security solutions, manufacturing plants, Working closely, Corporate Executive, Ireland manufacturing, manufacturing teams, finance operations, Supply Chain, Chain Operations, activity centers, 3Com regions, $1B, 1B comprehensive, comprehensive provider, wireless communications, software solutions, large enterprise, emergency response, response sectors, Originally hired, Assistant Controller, experienced substantial, substantial professional, professional growth, growth achieving, promotions culminating, global finance, finance team, team including, including accounting, financial reporting, working closely, Executive management, management team, Major Achievements, Technical Operations, Operations teams, created lease, licensing database, database solutions, maintain FCC, FCC regulatory, regulatory compliance, compliance saving, company $, individual billing, billing systems, senior management, timely business, business decisions, slow consolidation, producing standard, standard reporting, meaningful analysis, leadership team, better tools, database solution, solution mapping, individual billing, billing system, data warehouse, accurate close, Education Master, Business Administration, Finance Bachelor, Michigan State, State University, Accounting Skills, Skills 3Com, billing system, billing systems, Business Objects, contract review, cost analysis, Cost Control, data warehouse, Executive management, senior management, Financial Planning, financial reporting, Financial Analysis, Team Building, regulatory compliance, MS Access, MS Excel, MS PowerPoint, MS Word, Operations Management, process design, Process Improvement, improve product, Project Management, Supply Chain, tax laws]",
    "clean_data": "DIRECTOR FINANCE AND FP&A Executive Profile I'm a senior finance leader who thrives when working closely with the executive team in removing obstacles to directing the company beyond targeted growth. Early in my career I learned the value of looking beyond how things are currently done in order to continually search for how we can do things better. Working in cooperation with senior leadership throughout the organization, my finance teams are built with this focus and the results are enhanced analytics and dynamic reporting tools. Skill Highlights * Leadership  Forecasting Accounting Financial Analysis / Reporting Strategic Financial Planning Operations Management Data Development Process Improvement Functional Integration Budget Creation Tool / System Development Team Building / Management System Integrations Cost Control Mergers & Acquisitions Project Management Turnarounds/Restructurings International Hyperion Essbase * Hyperion Enterprise Hyperion Retrieve MS Access MS Excel MS PowerPoint MS Word FileMaker Minitab Storm WordPerfect 4D FAS 1000 Strategen AccPac BOSS Business Objects Daly & Wolcott Great Plain Dynamics Lawson MacPac OneGlobe Oracle * PeopleSoft QuickBooks SAP Magnitude TMS nSIMMS Monarch Razorsight Sage SQL Strategen Small business development Project management Leadership/communication skills Business operations organization Budgeting expertise Self-motivated Customer-oriented Professional Experience Director Finance and FP&A   Company Name   ï¼  City   ,  State A.T. Cross has a 169 year tradition of crafting fine writing instruments, A private equity firm held $120M global company, I was brought on board by the prior CFO to create a dynamic finance function as the company transitioned through two acquisitions. Major Achievements: In my first three months at A.T. Cross I developed an enhanced global budget tool that delivered budget on time and at the product sku level utilizing advanced MS Access. Over my first nine months at A.T. Cross I mapped five independent ERP systems and improved the consolidation process from a five week to a five day close. Constrained by systems and with no capital investment required, I created robust modeling and reporting tool utilizing advanced MS Excel and MS Access skills allowing for detailed analysis at the transaction level that previously had not existed postponing a $7M capital expense over the next three years Prior to planned implementation of SalesForce, I am working closely with sales leadership to develop KPI reporting dashboard and lead tracking tool to drive revenue growth while saving $200K. Co-leading supply chain review initiative including evaluation and improvement of supply chain and working capital KPI. Creating modeling tools in co-led effort to review and improve product costing practices. Senior Finance Consultant   Company Name   ï¼  City   ,  State Engaged with four companies over this period ranging from Granite City Electric a small, family-owned company to Staples, Sun Life Financial and Saint Gobain; I was brought in to hold interim senior finance roles and work closely with the executive teams through periods of transition. Major Achievements:. Even with robust ERP systems in place at Staples, the need to bridge various stand-alone systems was identified and I created an inventory database to track existing store assets while enabling real-time \"what-if\" analysis and cost planning related to proposed changes improving efficiency and predictive capabilities. With multiple global ERP systems in place at Saint Gobain, the executive team was looking for a dynamic and robust \"one-stop\", menu- driven reporting tool that I created utilizing Business Objects, advanced Excel and VBA increasing analytical capabilities and key metric analysis. Senior Finance Director   Company Name   ï¼  City   ,  State A provider of tailored, high capacity communications services, A private equity firm held company bought by Lightower Fiber Networks in 2012 for $2B, I was brought in to develop and lead the finance team and work with the executive team through the acquisitions of Con Ed Solution's (2007) and by RCN Communications (2008). Major Achievements:. Balancing the push and pull between sales efforts and maintaining margins was the focus of the Request for Proposal (RfP) tracking and analysis tool I developed to manage the contract review and approval process. Integrating two processes performed using MS Excel and monitored individually, I created and linked a sales pricing database with a cost identification database to foster improved sales decisions by bringing finance, sales and technical operations together in a formalized review. Telecommunications expenses represent 40% of total operating expenses at Sidera. Ensuring the accurate tracking and timely payment of these customer impacting costs are crucial. I created a circuit inventory tracking database to facilitate accurate cost analysis and reporting which resulted in a zero network outage rate over the subsequent two year period with $100K of estimated annual savings in penalties and fees. Global Engagement & Mobility Solutions Manager   Company Name   ï¼  City   ,  State Worldwide Director of Finance   January 2005   to  January 2006   Company Name   ï¼  City   ,  State a publicly traded global $3.5BM company providing management and technology consulting services to large companies and governmental institutions. I built and led finance function supporting deployment of more than 4,000 consulting resources across international borders to serve global clients, driving compliance with international immigration, income and social tax laws. Major Achievements:. Facing substantial fines, penalties and the possible discontinuation of operations I worked with external tax advisors, immigration providers, the International, Regional and Country Controllers, the Corporate Tax Department, Legal, the Payroll Department and my finance team to lead the process design behind the accounting related to 31 subsidiary countries. The result was a tracking database and accounting tool saving millions in fines, penalties and lost revenues. A publicly traded $1.3 billion global enterprise networking and security solutions with manufacturing plants in China and Mexico, Working closely with the Corporate Executive and Ireland manufacturing teams I led the accounting and finance operations for the Supply Chain Operations' six activity centers that served four 3Com regions. Director of Finance   January 1997   to  January 2005   Company Name   ï¼  City   ,  State A $1B comprehensive provider of wireless communications and software solutions to the healthcare, government, large enterprise and emergency response sectors, Originally hired as an Assistant Controller, I experienced substantial professional growth achieving three promotions culminating in overseeing the global finance team including accounting, financial reporting and analysis while working closely with the Executive management team. Major Achievements:. Working with the Engineering and Technical Operations teams I created lease and licensing database solutions in order to maintain FCC regulatory compliance saving the company $1.2M in penalties and fines. Through acquisition the company was operating 13 individual billing systems and the ability of senior management to make timely business decisions was hampered by a slow consolidation's process. With the focus on closing the books and producing standard reporting, meaningful analysis was an after-thought. In order to provide the leadership team with better tools I established a database solution mapping each individual billing system to my data warehouse with an export into Lawson that allowed for a timely and accurate close in less than five days. Education Master of Business Administration   :  Finance   ,  2016   University of Massachusetts   ï¼  City   ,  State   Finance Bachelor of Science   :  Accounting   Michigan State University   ï¼  City   ,  State   Accounting Skills 3Com, 4D, Accounting, AccPac, Acquisitions, billing system, billing systems, Budget, Business Objects, closing, consulting, contract review, Controller, cost analysis, Cost Control, costing, clients, data warehouse, database, driving, equity, ERP, Essbase, Excel and VBA, Executive management, senior management, FileMaker, finance, Financial, Financial Planning, financial reporting, Financial Analysis / Reporting, focus, Forecasting, Functional, government, Hyperion, inventory, Lawson, Team Building, Leadership, Legal, regulatory compliance, Mergers, MS Access, MS Excel, MS PowerPoint, MS Word, Minitab, modeling, Monarch, Enterprise, network, networking, Networks, next, Operations Management, Oracle, Payroll, PeopleSoft, pricing, process design, processes, Process Improvement, improve product, producing, Project Management, Proposal, QuickBooks, real-time, reporting, RfP, Sage, sales, SAP, SQL, Strategic, Sun, Supply Chain, tax laws, Tax, Telecommunications, WordPerfect",
    "emails": [],
    "entities": [
        "State Engaged",
        "RfP",
        "A.T. Cross",
        "Budget, Business Objects",
        "State A.T. Cross",
        "Business Administration",
        "Accounting",
        "SAP",
        "Project Management",
        "SQL",
        "Granite City Electric",
        "Operations Management",
        "FAS",
        "WordPerfect",
        "the Supply Chain Operations'",
        "FP&A Executive",
        "Tax, Telecommunications",
        "Daly & Wolcott Great Plain Dynamics",
        "Hyperion Enterprise Hyperion Retrieve MS Access MS Excel",
        "AccPac",
        "University of Massachusetts",
        "the Payroll Department",
        "the Engineering and Technical Operations",
        "Sun Life Financial and Saint Gobain",
        "Business Objects",
        "MS Excel",
        "Networks",
        "RCN Communications",
        "Acquisitions",
        "Executive",
        "CFO",
        "Lightower Fiber Networks",
        "VBA",
        "FileMaker",
        "Global Engagement & Mobility Solutions",
        "Financial, Financial Planning",
        "the Corporate Executive",
        "Financial Analysis / Reporting",
        "Monarch, Enterprise",
        "Hyperion",
        "State",
        "QuickBooks",
        "Oracle, Payroll",
        "MS Access",
        "Sun",
        "the Corporate Tax Department",
        "KPI",
        "Sidera",
        "Michigan State University",
        "PeopleSoft",
        "FCC",
        "ERP"
    ],
    "experience": "Experience Director Finance and FP&A    Company Name    ï¼   City    ,   State A.T. Cross has a 169 year tradition of crafting fine writing instruments , A private equity firm held $ 120 M global company , I was brought on board by the prior CFO to create a dynamic finance function as the company transitioned through two acquisitions . Major Achievements : In my first three months at A.T. Cross I developed an enhanced global budget tool that delivered budget on time and at the product sku level utilizing advanced MS Access . Over my first nine months at A.T. Cross I mapped five independent ERP systems and improved the consolidation process from a five week to a five day close . Constrained by systems and with no capital investment required , I created robust modeling and reporting tool utilizing advanced MS Excel and MS Access skills allowing for detailed analysis at the transaction level that previously had not existed postponing a $ 7 M capital expense over the next three years Prior to planned implementation of SalesForce , I am working closely with sales leadership to develop KPI reporting dashboard and lead tracking tool to drive revenue growth while saving $ 200K. Co - leading supply chain review initiative including evaluation and improvement of supply chain and working capital KPI . Creating modeling tools in co - led effort to review and improve product costing practices . Senior Finance Consultant    Company Name    ï¼   City    ,   State Engaged with four companies over this period ranging from Granite City Electric a small , family - owned company to Staples , Sun Life Financial and Saint Gobain ; I was brought in to hold interim senior finance roles and work closely with the executive teams through periods of transition . Major Achievements : . Even with robust ERP systems in place at Staples , the need to bridge various stand - alone systems was identified and I created an inventory database to track existing store assets while enabling real - time \" what - if \" analysis and cost planning related to proposed changes improving efficiency and predictive capabilities . With multiple global ERP systems in place at Saint Gobain , the executive team was looking for a dynamic and robust \" one - stop \" , menu- driven reporting tool that I created utilizing Business Objects , advanced Excel and VBA increasing analytical capabilities and key metric analysis . Senior Finance Director    Company Name    ï¼   City    ,   State A provider of tailored , high capacity communications services , A private equity firm held company bought by Lightower Fiber Networks in 2012 for $ 2B , I was brought in to develop and lead the finance team and work with the executive team through the acquisitions of Con Ed Solution 's ( 2007 ) and by RCN Communications ( 2008 ) . Major Achievements : . Balancing the push and pull between sales efforts and maintaining margins was the focus of the Request for Proposal ( RfP ) tracking and analysis tool I developed to manage the contract review and approval process . Integrating two processes performed using MS Excel and monitored individually , I created and linked a sales pricing database with a cost identification database to foster improved sales decisions by bringing finance , sales and technical operations together in a formalized review . Telecommunications expenses represent 40 % of total operating expenses at Sidera . Ensuring the accurate tracking and timely payment of these customer impacting costs are crucial . I created a circuit inventory tracking database to facilitate accurate cost analysis and reporting which resulted in a zero network outage rate over the subsequent two year period with $ 100 K of estimated annual savings in penalties and fees . Global Engagement & Mobility Solutions Manager    Company Name    ï¼   City    ,   State Worldwide Director of Finance    January 2005    to   January 2006    Company Name    ï¼   City    ,   State a publicly traded global $ 3.5BM company providing management and technology consulting services to large companies and governmental institutions . I built and led finance function supporting deployment of more than 4,000 consulting resources across international borders to serve global clients , driving compliance with international immigration , income and social tax laws . Major Achievements : . Facing substantial fines , penalties and the possible discontinuation of operations I worked with external tax advisors , immigration providers , the International , Regional and Country Controllers , the Corporate Tax Department , Legal , the Payroll Department and my finance team to lead the process design behind the accounting related to 31 subsidiary countries . The result was a tracking database and accounting tool saving millions in fines , penalties and lost revenues . A publicly traded $ 1.3 billion global enterprise networking and security solutions with manufacturing plants in China and Mexico , Working closely with the Corporate Executive and Ireland manufacturing teams I led the accounting and finance operations for the Supply Chain Operations ' six activity centers that served four 3Com regions . Director of Finance    January 1997    to   January 2005    Company Name    ï¼   City    ,   State A $ 1B comprehensive provider of wireless communications and software solutions to the healthcare , government , large enterprise and emergency response sectors , Originally hired as an Assistant Controller , I experienced substantial professional growth achieving three promotions culminating in overseeing the global finance team including accounting , financial reporting and analysis while working closely with the Executive management team . Major Achievements : . Working with the Engineering and Technical Operations teams I created lease and licensing database solutions in order to maintain FCC regulatory compliance saving the company $ 1.2 M in penalties and fines . Through acquisition the company was operating 13 individual billing systems and the ability of senior management to make timely business decisions was hampered by a slow consolidation 's process . With the focus on closing the books and producing standard reporting , meaningful analysis was an after - thought . In order to provide the leadership team with better tools I established a database solution mapping each individual billing system to my data warehouse with an export into Lawson that allowed for a timely and accurate close in less than five days . Education Master of Business Administration    :   Finance    ,   2016    University of Massachusetts    ï¼   City    ,   State    Finance Bachelor of Science    :   Accounting    Michigan State University    ï¼   City    ,   State    Accounting Skills 3Com , 4D , Accounting , AccPac , Acquisitions , billing system , billing systems , Budget , Business Objects , closing , consulting , contract review , Controller , cost analysis , Cost Control , costing , clients , data warehouse , database , driving , equity , ERP , Essbase , Excel and VBA , Executive management , senior management , FileMaker , finance , Financial , Financial Planning , financial reporting , Financial Analysis / Reporting , focus , Forecasting , Functional , government , Hyperion , inventory , Lawson , Team Building , Leadership , Legal , regulatory compliance , Mergers , MS Access , MS Excel , MS PowerPoint , MS Word , Minitab , modeling , Monarch , Enterprise , network , networking , Networks , next , Operations Management , Oracle , Payroll , PeopleSoft , pricing , process design , processes , Process Improvement , improve product , producing , Project Management , Proposal , QuickBooks , real - time , reporting , RfP , Sage , sales , SAP , SQL , Strategic , Sun , Supply Chain , tax laws , Tax , Telecommunications , WordPerfect",
    "extracted_keywords": [
        "DIRECTOR",
        "FINANCE",
        "FP&A",
        "Executive",
        "Profile",
        "finance",
        "leader",
        "team",
        "obstacles",
        "company",
        "growth",
        "career",
        "value",
        "things",
        "order",
        "things",
        "cooperation",
        "leadership",
        "organization",
        "finance",
        "teams",
        "focus",
        "results",
        "analytics",
        "reporting",
        "tools",
        "Skill",
        "Highlights",
        "Leadership",
        "Forecasting",
        "Accounting",
        "Financial",
        "Analysis",
        "Strategic",
        "Financial",
        "Planning",
        "Operations",
        "Management",
        "Data",
        "Development",
        "Process",
        "Improvement",
        "Functional",
        "Integration",
        "Budget",
        "Creation",
        "Tool",
        "System",
        "Development",
        "Team",
        "Building",
        "Management",
        "System",
        "Integrations",
        "Cost",
        "Control",
        "Mergers",
        "Acquisitions",
        "Project",
        "Management",
        "Turnarounds",
        "Restructurings",
        "International",
        "Hyperion",
        "Essbase",
        "*",
        "Hyperion",
        "Enterprise",
        "Hyperion",
        "Retrieve",
        "MS",
        "Access",
        "MS",
        "Excel",
        "MS",
        "PowerPoint",
        "MS",
        "Word",
        "FileMaker",
        "Minitab",
        "Storm",
        "WordPerfect",
        "4D",
        "FAS",
        "Strategen",
        "AccPac",
        "BOSS",
        "Business",
        "Daly",
        "Wolcott",
        "Great",
        "Plain",
        "Dynamics",
        "Lawson",
        "MacPac",
        "OneGlobe",
        "Oracle",
        "PeopleSoft",
        "QuickBooks",
        "SAP",
        "Magnitude",
        "TMS",
        "nSIMMS",
        "Monarch",
        "Razorsight",
        "Sage",
        "SQL",
        "Strategen",
        "business",
        "development",
        "Project",
        "management",
        "Leadership",
        "communication",
        "skills",
        "Business",
        "operations",
        "organization",
        "Budgeting",
        "expertise",
        "Self",
        "Customer",
        "Professional",
        "Experience",
        "Director",
        "Finance",
        "FP&A",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "A.T.",
        "Cross",
        "year",
        "tradition",
        "writing",
        "instruments",
        "equity",
        "firm",
        "M",
        "company",
        "board",
        "CFO",
        "finance",
        "function",
        "company",
        "acquisitions",
        "Achievements",
        "months",
        "A.T.",
        "Cross",
        "budget",
        "tool",
        "budget",
        "time",
        "product",
        "sku",
        "level",
        "MS",
        "Access",
        "months",
        "A.T.",
        "Cross",
        "ERP",
        "systems",
        "consolidation",
        "process",
        "week",
        "day",
        "systems",
        "capital",
        "investment",
        "modeling",
        "tool",
        "MS",
        "Excel",
        "MS",
        "Access",
        "skills",
        "analysis",
        "transaction",
        "level",
        "M",
        "capital",
        "expense",
        "years",
        "implementation",
        "SalesForce",
        "sales",
        "leadership",
        "KPI",
        "reporting",
        "dashboard",
        "tool",
        "revenue",
        "growth",
        "200K.",
        "Co",
        "supply",
        "chain",
        "review",
        "initiative",
        "evaluation",
        "improvement",
        "supply",
        "chain",
        "capital",
        "KPI",
        "modeling",
        "tools",
        "effort",
        "product",
        "practices",
        "Senior",
        "Finance",
        "Consultant",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "companies",
        "period",
        "Granite",
        "City",
        "Electric",
        "family",
        "company",
        "Staples",
        "Sun",
        "Life",
        "Financial",
        "Saint",
        "Gobain",
        "finance",
        "roles",
        "teams",
        "periods",
        "transition",
        "Achievements",
        "ERP",
        "systems",
        "place",
        "Staples",
        "need",
        "systems",
        "inventory",
        "database",
        "store",
        "assets",
        "time",
        "analysis",
        "cost",
        "planning",
        "changes",
        "efficiency",
        "capabilities",
        "ERP",
        "systems",
        "place",
        "Saint",
        "Gobain",
        "team",
        "stop",
        "reporting",
        "tool",
        "Business",
        "Objects",
        "Excel",
        "VBA",
        "capabilities",
        "analysis",
        "Senior",
        "Finance",
        "Director",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "A",
        "provider",
        "capacity",
        "communications",
        "services",
        "equity",
        "firm",
        "company",
        "Lightower",
        "Fiber",
        "Networks",
        "2B",
        "finance",
        "team",
        "team",
        "acquisitions",
        "Con",
        "Ed",
        "Solution",
        "RCN",
        "Communications",
        "Achievements",
        "push",
        "sales",
        "efforts",
        "margins",
        "focus",
        "Request",
        "Proposal",
        "RfP",
        "tracking",
        "analysis",
        "tool",
        "contract",
        "review",
        "approval",
        "process",
        "processes",
        "MS",
        "Excel",
        "sales",
        "pricing",
        "database",
        "cost",
        "identification",
        "database",
        "sales",
        "decisions",
        "finance",
        "sales",
        "operations",
        "review",
        "Telecommunications",
        "expenses",
        "%",
        "operating",
        "expenses",
        "Sidera",
        "tracking",
        "payment",
        "customer",
        "impacting",
        "costs",
        "circuit",
        "inventory",
        "database",
        "cost",
        "analysis",
        "reporting",
        "network",
        "outage",
        "rate",
        "year",
        "period",
        "K",
        "savings",
        "penalties",
        "fees",
        "Global",
        "Engagement",
        "Mobility",
        "Solutions",
        "Manager",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "Worldwide",
        "Director",
        "Finance",
        "January",
        "January",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "company",
        "management",
        "technology",
        "consulting",
        "services",
        "companies",
        "institutions",
        "finance",
        "function",
        "deployment",
        "resources",
        "borders",
        "clients",
        "compliance",
        "immigration",
        "income",
        "tax",
        "laws",
        "Achievements",
        "fines",
        "penalties",
        "discontinuation",
        "operations",
        "tax",
        "advisors",
        "immigration",
        "providers",
        "International",
        "Regional",
        "Country",
        "Controllers",
        "Corporate",
        "Tax",
        "Department",
        "Legal",
        "Payroll",
        "Department",
        "finance",
        "team",
        "process",
        "design",
        "accounting",
        "subsidiary",
        "countries",
        "result",
        "tracking",
        "database",
        "accounting",
        "tool",
        "millions",
        "fines",
        "penalties",
        "revenues",
        "enterprise",
        "networking",
        "security",
        "solutions",
        "manufacturing",
        "plants",
        "China",
        "Mexico",
        "Corporate",
        "Executive",
        "Ireland",
        "manufacturing",
        "teams",
        "accounting",
        "finance",
        "operations",
        "Supply",
        "Chain",
        "Operations",
        "activity",
        "centers",
        "regions",
        "Director",
        "Finance",
        "January",
        "January",
        "Company",
        "Name",
        "ï¼",
        "City",
        "State",
        "provider",
        "communications",
        "software",
        "solutions",
        "healthcare",
        "government",
        "enterprise",
        "emergency",
        "response",
        "sectors",
        "Assistant",
        "Controller",
        "growth",
        "promotions",
        "finance",
        "team",
        "accounting",
        "reporting",
        "analysis",
        "Executive",
        "management",
        "team",
        "Achievements",
        "Engineering",
        "Technical",
        "Operations",
        "teams",
        "lease",
        "licensing",
        "database",
        "solutions",
        "order",
        "FCC",
        "compliance",
        "company",
        "penalties",
        "fines",
        "acquisition",
        "company",
        "billing",
        "systems",
        "ability",
        "management",
        "business",
        "decisions",
        "consolidation",
        "process",
        "focus",
        "books",
        "reporting",
        "analysis",
        "thought",
        "order",
        "leadership",
        "team",
        "tools",
        "database",
        "solution",
        "billing",
        "system",
        "data",
        "warehouse",
        "export",
        "Lawson",
        "days",
        "Education",
        "Master",
        "Business",
        "Administration",
        "Finance",
        "University",
        "Massachusetts",
        "ï¼",
        "City",
        "State",
        "Finance",
        "Bachelor",
        "Science",
        "Accounting",
        "Michigan",
        "State",
        "University",
        "ï¼",
        "City",
        "State",
        "Accounting",
        "Skills",
        "4D",
        "Accounting",
        "AccPac",
        "Acquisitions",
        "billing",
        "system",
        "billing",
        "systems",
        "Budget",
        "Business",
        "Objects",
        "closing",
        "consulting",
        "contract",
        "review",
        "Controller",
        "cost",
        "analysis",
        "Cost",
        "Control",
        "costing",
        "clients",
        "data",
        "warehouse",
        "database",
        "driving",
        "equity",
        "ERP",
        "Essbase",
        "Excel",
        "VBA",
        "Executive",
        "management",
        "management",
        "FileMaker",
        "finance",
        "Financial",
        "Financial",
        "Planning",
        "reporting",
        "Financial",
        "Analysis",
        "Reporting",
        "focus",
        "Forecasting",
        "Functional",
        "government",
        "Hyperion",
        "inventory",
        "Lawson",
        "Team",
        "Building",
        "Leadership",
        "Legal",
        "compliance",
        "Mergers",
        "MS",
        "Access",
        "MS",
        "Excel",
        "MS",
        "PowerPoint",
        "MS",
        "Word",
        "Minitab",
        "modeling",
        "Monarch",
        "Enterprise",
        "network",
        "networking",
        "Networks",
        "Operations",
        "Management",
        "Oracle",
        "Payroll",
        "PeopleSoft",
        "pricing",
        "process",
        "design",
        "processes",
        "Process",
        "Improvement",
        "product",
        "Project",
        "Management",
        "Proposal",
        "QuickBooks",
        "time",
        "reporting",
        "RfP",
        "Sage",
        "sales",
        "SAP",
        "SQL",
        "Strategic",
        "Sun",
        "Supply",
        "Chain",
        "tax",
        "laws",
        "Tax",
        "Telecommunications",
        "WordPerfect"
    ],
    "keyterms": [
        [
            "executive team",
            0.13018208109286228
        ],
        [
            "finance team",
            0.06133523980730527
        ],
        [
            "MS Excel",
            0.05895018297733121
        ],
        [
            "MS Access",
            0.05805305251737897
        ],
        [
            "major achievement",
            0.054424682157165824
        ],
        [
            "A.T. Cross",
            0.05406462653068826
        ],
        [
            "ERP system",
            0.0428536271106027
        ],
        [
            "company",
            0.02707687016509839
        ],
        [
            "tool",
            0.018722945972660072
        ],
        [
            "senior",
            0.013665993855896372
        ],
        [
            "City",
            0.011564374279606639
        ],
        [
            "FP&A",
            0.01114837551384839
        ],
        [
            "reporting",
            0.011088749646414039
        ],
        [
            "Executive",
            0.010734823935035252
        ],
        [
            "ï¼",
            0.010127090077419344
        ],
        [
            "leadership",
            0.009876518417929754
        ],
        [
            "Financial",
            0.009786894325921544
        ],
        [
            "global",
            0.009336462546675646
        ],
        [
            "Management",
            0.009329067855716125
        ],
        [
            "Finance",
            0.009188653080626335
        ]
    ],
    "phones": [],
    "resume_data": "DIRECTOR FINANCE AND FP&A\nExecutive Profile\nI'm a senior finance leader who thrives when working closely with the executive team in removing obstacles to directing the company beyond\ntargeted growth. Early in my career I learned the value of looking beyond how things are currently done in order to continually search for how we\ncan do things better. Working in cooperation with senior leadership throughout the organization, my finance teams are built with this focus and the\nresults are enhanced analytics and dynamic reporting tools.\nSkill Highlights\n* Leadership \nForecasting\nAccounting\nFinancial Analysis / Reporting\nStrategic Financial Planning Operations Management\nData Development\nProcess Improvement\nFunctional Integration\nBudget Creation\nTool / System Development\nTeam Building / Management\nSystem Integrations\nCost Control\nMergers & Acquisitions\nProject Management\nTurnarounds/Restructurings\nInternational Hyperion Essbase * Hyperion Enterprise\nHyperion Retrieve\nMS Access\nMS Excel\nMS PowerPoint\nMS Word\nFileMaker\nMinitab\nStorm\nWordPerfect\n4D\nFAS 1000\nStrategen\nAccPac\nBOSS\nBusiness Objects\nDaly & Wolcott\nGreat Plain Dynamics\nLawson\nMacPac\nOneGlobe\nOracle *\nPeopleSoft\nQuickBooks\nSAP\nMagnitude\nTMS\nnSIMMS\nMonarch\nRazorsight\nSage\nSQL\nStrategen\nSmall business development\nProject management\nLeadership/communication skills\nBusiness operations organization\nBudgeting expertise\nSelf-motivated\nCustomer-oriented\nProfessional Experience\nDirector Finance and FP&A\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nA.T.\nCross has a 169 year tradition of crafting fine writing instruments, A private equity firm held $120M global company, I was brought on\nboard by the prior CFO to create a dynamic finance function as the company transitioned through two acquisitions. Major Achievements: In my first three months at A.T.\nCross I developed an enhanced global budget tool that delivered budget on time and at the product sku level utilizing advanced MS Access.\nOver my first nine months at A.T.\nCross I mapped five independent ERP systems and improved the consolidation process from a five week to a five day close.\nConstrained by systems and with no capital investment required, I created robust modeling and reporting tool utilizing advanced MS Excel\nand MS Access skills allowing for detailed analysis at the transaction level that previously had not existed postponing a $7M capital expense\nover the next three years Prior to planned implementation of SalesForce, I am working closely with sales leadership to develop KPI\nreporting dashboard and lead tracking tool to drive revenue growth while saving $200K.\nCo-leading supply chain review initiative including evaluation and improvement of supply chain and working capital KPI.\nCreating modeling tools in co-led effort to review and improve product costing practices.\nSenior Finance Consultant\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nEngaged with four companies over this period ranging from Granite City Electric a small, family-owned company to Staples, Sun Life\nFinancial and Saint Gobain; I was brought in to hold interim senior finance roles and work closely with the executive teams through periods\nof transition.\nMajor Achievements:.\nEven with robust ERP systems in place at Staples, the need to bridge various stand-alone systems was identified and I created an inventory\ndatabase to track existing store assets while enabling real-time \"what-if\" analysis and cost planning related to proposed changes improving\nefficiency and predictive capabilities.\nWith multiple global ERP systems in place at Saint Gobain, the executive team was looking for a dynamic and robust \"one-stop\", menu-\ndriven reporting tool that I created utilizing Business Objects, advanced Excel and VBA increasing analytical capabilities and key metric\nanalysis.\nSenior Finance Director\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nA provider of tailored, high capacity communications services, A private equity firm held company bought by Lightower Fiber Networks in\n2012 for $2B, I was brought in to develop and lead the finance team and work with the executive team through the acquisitions of Con Ed\nSolution's (2007) and by RCN Communications (2008).\nMajor Achievements:.\nBalancing the push and pull between sales efforts and maintaining margins was the focus of the Request for Proposal (RfP) tracking and\nanalysis tool I developed to manage the contract review and approval process.\nIntegrating two processes performed using MS Excel and monitored individually, I created and linked a sales pricing database with a cost\nidentification database to foster improved sales decisions by bringing finance, sales and technical operations together in a formalized review.\nTelecommunications expenses represent 40% of total operating expenses at Sidera.\nEnsuring the accurate tracking and timely payment of these customer impacting costs are crucial.\nI created a circuit inventory tracking database to facilitate accurate cost analysis and reporting which resulted in a zero network outage rate\nover the subsequent two year period with $100K of estimated annual savings in penalties and fees.\nGlobal Engagement & Mobility Solutions Manager\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nWorldwide Director of Finance\n \nJanuary 2005\n \nto \nJanuary 2006\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\na publicly traded global $3.5BM company providing management and technology consulting services to large companies and governmental\ninstitutions.\nI built and led finance function supporting deployment of more than 4,000 consulting resources across international borders to serve global\nclients, driving compliance with international immigration, income and social tax laws.\nMajor Achievements:.\nFacing substantial fines, penalties and the possible discontinuation of operations I worked with external tax advisors, immigration providers,\nthe International, Regional and Country Controllers, the Corporate Tax Department, Legal, the Payroll Department and my finance team to\nlead the process design behind the accounting related to 31 subsidiary countries.\nThe result was a tracking database and accounting tool saving millions in fines, penalties and lost revenues.\nA publicly traded $1.3 billion global enterprise networking and security solutions with manufacturing plants in China and Mexico, Working\nclosely with the Corporate Executive and Ireland manufacturing teams I led the accounting and finance operations for the Supply Chain\nOperations' six activity centers that served four 3Com regions.\nDirector of Finance\n \nJanuary 1997\n \nto \nJanuary 2005\n \nCompany Name\n \nï¼​ \nCity\n \n, \nState\nA $1B comprehensive provider of wireless communications and software solutions to the healthcare, government, large enterprise and\nemergency response sectors, Originally hired as an Assistant Controller, I experienced substantial professional growth achieving three\npromotions culminating in overseeing the global finance team including accounting, financial reporting and analysis while working closely with\nthe Executive management team.\nMajor Achievements:. Working with the Engineering and Technical Operations teams I created lease and licensing database solutions in order to maintain FCC\nregulatory compliance saving the company $1.2M in penalties and fines.\nThrough acquisition the company was operating 13 individual billing systems and the ability of senior management to make timely business\ndecisions was hampered by a slow consolidation's process.\nWith the focus on closing the books and producing standard reporting, meaningful analysis was an after-thought.\nIn order to provide the leadership team with better tools I established a database solution mapping each individual billing system to my data\nwarehouse with an export into Lawson that allowed for a timely and accurate close in less than five days.\nEducation\nMaster of Business Administration\n \n: \nFinance\n \n, \n2016\n \nUniversity of Massachusetts\n \nï¼​ \nCity\n \n, \nState\n \nFinance\nBachelor of Science\n \n: \nAccounting\n \nMichigan State University\n \nï¼​ \nCity\n \n, \nState\n \nAccounting\nSkills\n3Com, 4D, Accounting, AccPac, Acquisitions, billing system, billing systems, Budget, Business Objects, closing, consulting, contract review,\nController, cost analysis, Cost Control, costing, clients, data warehouse, database, driving, equity, ERP, Essbase, Excel and VBA, Executive\nmanagement, senior management, FileMaker, finance, Financial, Financial Planning, financial reporting, Financial Analysis / Reporting, focus,\nForecasting, Functional, government, Hyperion, inventory, Lawson, Team Building, Leadership, Legal, regulatory compliance, Mergers, MS\nAccess, MS Excel, MS PowerPoint, MS Word, Minitab, modeling, Monarch, Enterprise, network, networking, Networks, next, Operations\nManagement, Oracle, Payroll, PeopleSoft, pricing, process design, processes, Process Improvement, improve product, producing, Project\nManagement, Proposal, QuickBooks, real-time, reporting, RfP, Sage, sales, SAP, SQL, Strategic, Sun, Supply Chain, tax laws, Tax,\nTelecommunications, WordPerfect",
    "tri_grams": "[FINANCE AND FP&A, FP&A Executive Profile, senior finance leader, leader who thrives, thrives when working, team in removing, obstacles to directing, directing the company, company beyond targeted, career I learned, learned the value, value of looking, things are currently, order to continually, Working in cooperation, cooperation with senior, teams are built, results are enhanced, analytics and dynamic, dynamic reporting tools, Forecasting Accounting Financial, Accounting Financial Analysis, Reporting Strategic Financial, Strategic Financial Planning, Financial Planning Operations, Planning Operations Management, Operations Management Data, Management Data Development, Data Development Process, Development Process Improvement, Process Improvement Functional, Improvement Functional Integration, Functional Integration Budget, Integration Budget Creation, Budget Creation Tool, System Development Team, Development Team Building, Management System Integrations, System Integrations Cost, Integrations Cost Control, Cost Control Mergers, Acquisitions Project Management, Project Management Turnarounds, Restructurings International Hyperion, International Hyperion Essbase, Hyperion Enterprise Hyperion, Enterprise Hyperion Retrieve, Hyperion Retrieve MS, Retrieve MS Access, MS Access MS, Access MS Excel, MS Excel MS, Excel MS PowerPoint, MS PowerPoint MS, PowerPoint MS Word, MS Word FileMaker, Word FileMaker Minitab, FileMaker Minitab Storm, Minitab Storm WordPerfect, Storm WordPerfect 4D, WordPerfect 4D FAS, Strategen AccPac BOSS, AccPac BOSS Business, BOSS Business Objects, Business Objects Daly, Wolcott Great Plain, Great Plain Dynamics, Plain Dynamics Lawson, Dynamics Lawson MacPac, Lawson MacPac OneGlobe, MacPac OneGlobe Oracle, PeopleSoft QuickBooks SAP, QuickBooks SAP Magnitude, SAP Magnitude TMS, Magnitude TMS nSIMMS, TMS nSIMMS Monarch, nSIMMS Monarch Razorsight, Monarch Razorsight Sage, Razorsight Sage SQL, Sage SQL Strategen, SQL Strategen Small, Strategen Small business, Small business development, business development Project, development Project management, Project management Leadership, communication skills Business, skills Business operations, Business operations organization, operations organization Budgeting, organization Budgeting expertise, Budgeting expertise Self, oriented Professional Experience, Professional Experience Director, Experience Director Finance, Finance and FP&A, State A.T. Cross, tradition of crafting, crafting fine writing, fine writing instruments, private equity firm, equity firm held, firm held $, M global company, brought on board, CFO to create, create a dynamic, dynamic finance function, months at A.T., Cross I developed, developed an enhanced, enhanced global budget, global budget tool, tool that delivered, budget on time, product sku level, sku level utilizing, level utilizing advanced, utilizing advanced MS, advanced MS Access, months at A.T., Cross I mapped, independent ERP systems, systems and improved, improved the consolidation, Constrained by systems, capital investment required, created robust modeling, modeling and reporting, reporting tool utilizing, tool utilizing advanced, utilizing advanced MS, advanced MS Excel, Excel and MS, MS Access skills, Access skills allowing, allowing for detailed, level that previously, postponing a $, M capital expense, Prior to planned, implementation of SalesForce, closely with sales, leadership to develop, develop KPI reporting, KPI reporting dashboard, dashboard and lead, lead tracking tool, tool to drive, drive revenue growth, growth while saving, saving $200K., $200K. Co, leading supply chain, supply chain review, chain review initiative, review initiative including, initiative including evaluation, evaluation and improvement, improvement of supply, chain and working, working capital KPI, Creating modeling tools, tools in co, effort to review, review and improve, improve product costing, product costing practices, Senior Finance Consultant, ranging from Granite, Granite City Electric, Electric a small, company to Staples, Sun Life Financial, Financial and Saint, hold interim senior, interim senior finance, senior finance roles, roles and work, teams through periods, periods of transition, robust ERP systems, systems in place, place at Staples, need to bridge, bridge various stand, systems was identified, created an inventory, database to track, track existing store, existing store assets, assets while enabling, analysis and cost, cost planning related, related to proposed, proposed changes improving, changes improving efficiency, efficiency and predictive, multiple global ERP, global ERP systems, systems in place, place at Saint, team was looking, dynamic and robust, menu- driven reporting, driven reporting tool, created utilizing Business, utilizing Business Objects, Excel and VBA, VBA increasing analytical, increasing analytical capabilities, capabilities and key, key metric analysis, Senior Finance Director, State A provider, provider of tailored, high capacity communications, capacity communications services, private equity firm, equity firm held, firm held company, held company bought, bought by Lightower, Lightower Fiber Networks, develop and lead, lead the finance, team and work, acquisitions of Con, Con Ed Solution, Balancing the push, push and pull, pull between sales, efforts and maintaining, Request for Proposal, tracking and analysis, tool I developed, developed to manage, manage the contract, review and approval, performed using MS, Excel and monitored, created and linked, linked a sales, sales pricing database, cost identification database, database to foster, foster improved sales, improved sales decisions, decisions by bringing, sales and technical, Telecommunications expenses represent, total operating expenses, expenses at Sidera, Ensuring the accurate, tracking and timely, customer impacting costs, costs are crucial, created a circuit, circuit inventory tracking, inventory tracking database, database to facilitate, facilitate accurate cost, accurate cost analysis, analysis and reporting, reporting which resulted, network outage rate, period with $, K of estimated, estimated annual savings, savings in penalties, penalties and fees, Mobility Solutions Manager, State Worldwide Director, Director of Finance, State a publicly, publicly traded global, traded global $, global $3.5BM, $3.5BM company, 3.5BM company providing, company providing management, management and technology, technology consulting services, services to large, companies and governmental, built and led, led finance function, finance function supporting, function supporting deployment, resources across international, borders to serve, serve global clients, compliance with international, income and social, social tax laws, Facing substantial fines, discontinuation of operations, operations I worked, worked with external, external tax advisors, Regional and Country, Corporate Tax Department, team to lead, lead the process, database and accounting, accounting tool saving, tool saving millions, millions in fines, penalties and lost, publicly traded $, global enterprise networking, networking and security, solutions with manufacturing, plants in China, China and Mexico, Executive and Ireland, Ireland manufacturing teams, teams I led, led the accounting, accounting and finance, Supply Chain Operations, centers that served, Director of Finance, State A $, $1B comprehensive, 1B comprehensive provider, provider of wireless, communications and software, enterprise and emergency, emergency response sectors, experienced substantial professional, substantial professional growth, professional growth achieving, culminating in overseeing, overseeing the global, global finance team, finance team including, team including accounting, reporting and analysis, analysis while working, Executive management team, Engineering and Technical, Technical Operations teams, teams I created, lease and licensing, licensing database solutions, solutions in order, order to maintain, maintain FCC regulatory, FCC regulatory compliance, regulatory compliance saving, saving the company, M in penalties, penalties and fines, acquisition the company, company was operating, individual billing systems, ability of senior, timely business decisions, decisions was hampered, consolidation's process, focus on closing, closing the books, books and producing, producing standard reporting, order to provide, provide the leadership, team with better, tools I established, established a database, database solution mapping, mapping each individual, individual billing system, export into Lawson, Lawson that allowed, timely and accurate, Master of Business, University of Massachusetts, Bachelor of Science, Michigan State University, Accounting Skills 3Com, Excel and VBA]",
    "unique_id": "6c03d038-8b68-406f-a896-94ac2ce8cdbb",
    "years": []
}