{
    "bi_grams": "[GRADUATE RESEARCH, RESEARCH ASSISTANT, ASSISTANT Profile, Profile Results, driven Animal, Animal Nutritionist, good research, teaching experience, experience Areas, Expertise Dairy, Dairy Nutrition, Nutrition Food, Food Safety, Safety Feed, Feed supplementation, supplementation strategies, strategies Professional, Professional Experience, Experience Graduate, Graduate Research, Research Assistant, State Ongoing, Ongoing Researches, Researches -Effect, prototype sequestering, sequestering agents, milk aflatoxin, aflatoxin M1, M1 concentrations, dairy cows, cows fed, fed aflatoxin, aflatoxin B1, contaminated diets, -The effect, selected lactic, lactic acid, acid bacteria, microbial composition, probiotic effects, ruminants -An, vitro study, tropical plants, essential oils, mitigating methanogenesis, Assistant Lecturer, State -Instructed, animal feed, feeding course, course -Lectured, communicated effectively, diverse backgroups, backgroups -Inspired, -Inspired students, academic interests, real world, taking positive, positive actions, actions Education, Education Ph.D., Ruminant Nutrition, USA Awards, Awards -Grinter, -Grinter Fellowship, outstanding new, new PhD, PhD students, students -Certificate, outstanding academic, academic achievement, Florida International, International Center, Center Master, Monogastric Nutrition, Nigeria Awards, Awards -University, Agriculture Graduate, Graduate Fellowship, Fellowship -Postgraduate, -Postgraduate Tuition, Tuition Scholarship, Class Students, University -Dufil, -Dufil Prima, Prima Schloarship, postgraduate students, Nutrition Bachelor, Animal Nutrition, Nigeria Award, Award Academic, Academic achievement, achievement award, Affiliations Nigerian, Nigerian Society, Animal Production, Production American, American Society, Animal Science, Science Publications, Publications Peer, reviewed Publications, Publications -C., -C. M., M. Huisden, N. J., J. Szabo, I.M. Ogunade, A. T., T. Adesogan, Mucuna pruriens, pruriens detoxification, ensiling duration, particle size, Animal Feed, Feed Science, -Ogunade I.M., O.M Sogunle, salmonella organisms, laying hens, feed additives, Nigeria Poultry, Poultry Science, Science Journal, -Olorunsola R.A, Eruvbetine D, Oyekunle M.A, Jegede A.V, Ogunade I.M, Salmonella organism, organism transmission, hatching broiler, broiler eggs, -I.B Allison, D.A Ekunseitan, A.A Ayoola, S.O Iposu, O.M.O Idowu, I.M Ogunade, S.O Osho, beak amputation, pecking rate, rate damage, performance parameters, Paskitan Journal, Biological Sciences, Sciences 16(19, -R.A. Sobayo, A. O., O. Oso, O.A. Adeyemi, O.G. Sodipe, A.O. Fafiolu, I.M. Ogunade, Growth response, nutrient digestibility, broiler chicken, chicken fed, fed graded, graded levels, Garcinia kola, Bitter kola, Applied Agricultural, Agricultural Research, Research 5(1, Official Publication, Agricultural Research, Research Institute, -A. O., O. Oso, A. S., S. Haastrup, A. J., J. Ajibade, K.O. Olowonefa, A.O. Aluko, I.M. Ogunade, S.O. Osho, A.M. Bamgbose, Growth performance, apparent nutrient, nutrient digestibility, caecal fermentation, ileal morphology, caecal microflora, growing rabbits, rabbits fed, fed diet, diet containing, containing probiotics, Livestock Science, A. O, G.A. Williams, A.V. Jegede, R.A. Sobayo, A.O. Fafiolu, O.M.O. Idowu, M. O., O. Sogunle, O.S. Akinola, O.O. Adeleye, l A.R., A.R. Olorunsola, I.M. Ogunade, S.O. Osho, F.O. Obadire, A.M Bamgbose, Interactive effect, millet feeding, mannan oligossaccharides, oligossaccharides supplementation, growth performance, serum biochemistry, organ weights, helmeted guinea, guinea fowl, Numidia meleagris, Livestock Science, Health status, blood parameters, weaner rabbits, rabbits fed, fed diets, diets containing, containing varying, varying dietary, dietary fibre, digestible energy, energy levels, International Institute, UNITED STATES, Coat Colour, Water Intake, Feed Utilization, Intensively Reared, Reared West, West African, African Dwarf, Dwarf Sheep, Humid Tropics, International Institute, UNITED STATES, Visual assessment, proximate composition, cost analysis, differently processed, processed discarded, discarded vegetable, bovine blood, rumen content, content mixtures, conventional feedstuffs, Short Communication, Communication Nigerian, Nigerian Journal, Animal Production, Production 39(2):211, Conference Papers, Papers -Ibukun, -Ibukun M., M. Ogunade, Kathy G., G. Arriola, Rafael M., M. Martins, Bibiana Y., Y. Coy, Chelsea L., L. Curry, Deborah K., K. Terkoski, Amber Rubright, Marcos G., G. Zenobi, Zhengxin Ma, Charles R., R. Staples, Adegbola T., T. Adesogan, prototype sequestering, sequestering agents, milk aflatoxin, aflatoxin M1, M1 concentrations, dairy cows, cows fed, fed aflatoxin, aflatoxin B1, contaminated diets, CSAS Joint, Joint Annual, Annual Meeting, -O. Oso, O. Erinle, A.V. Jegede, A.O. Fafiolu, R.A. Sobayo, R. Olorunsola, A.M. Bamgbose, I.M. Ogunade, S.O. Osho, W.A. Olayemi, F.O. Oke, millet feeding, mannan oligosaccharides, oligosaccharides supplementation, organ weights, Cockerel Chicks, UK Branch, Annual Meeting, Meeting 16th-17th, 16th-17th April, Jubilee Campus, Nottingham University, UNITED KINGDOM, KINGDOM -Ogunade, Eruvbetine D, A. O., Osho S.O, Ekunseitan D.A., dietary mannan, mannan oligosaccharides, Salmonella organisms, sampled laying, laying hens, Western Nigeria, Poultry Science, Science Association, UK Branch, Annual meeting, Jubilee Campus, Nottingham University, British Poultry, Poultry Abstracts, UNITED KINGDOM, KINGDOM Skills, Skills -Great, -Great Organizational, Organizational skills, skills -Good, -Good Numerical, analytical skills]",
    "clean_data": "GRADUATE RESEARCH ASSISTANT Profile Results-driven Animal Nutritionist with good research and teaching experience Areas of Expertise Dairy Nutrition Food Safety Feed supplementation strategies Professional Experience Graduate Research Assistant   07/2013   to  Current   Company Name   City   ,  State Ongoing Researches -Effect of prototype sequestering agents on performance and milk aflatoxin M1 concentrations of dairy cows fed aflatoxin B1-contaminated diets. -The effect of selected lactic acid bacteria on the microbial composition and on the survival of pathogens in the rumen in context with their probiotic effects on ruminants -An in-vitro study on the use of tropical plants and essential oils in mitigating methanogenesis in ruminant. Assistant Lecturer   08/2010   to  06/2013   Company Name   City   ,  State -Instructed a class of 156 students in animal feed and feeding course -Lectured and communicated effectively with students from diverse backgroups -Inspired students to translate their academic interests into the real world by taking positive actions Education Ph.D.   :  Ruminant Nutrition   2017   University of Florida   City   ,  State   ,  USA Awards -Grinter Fellowship for outstanding new PhD students -Certificate of outstanding academic achievement, University of Florida International Center Master of Science   :  Monogastric Nutrition   2011   University of Agriculture   City   ,  State   ,  Nigeria Awards -University of Agriculture Graduate Fellowship -Postgraduate Tuition Scholarship for First Class Students in the University -Dufil Prima Schloarship for postgraduate students in Nutrition Bachelor of Agriculture   :  Animal Nutrition   2009   University of Agriculture, Abeokuta   City   ,  State   ,  Nigeria Award Academic achievement award for graduating with a First class...4.59 out of 5.00. Affiliations Nigerian Society of Animal Production American Society of Animal Science Publications Peer-reviewed Publications -C. M. Huisden, N. J. Szabo,  I.M. Ogunade and A. T. Adesogan (2014). Mucuna pruriens detoxification: 1. Effects of ensiling duration and particle size. Animal Feed Science and Technology. (IN PRESS). -Ogunade I.M., Eruvbetine., D., Oyekunle, A.O, Fafiolu, A.O, Olorunsola, R.A., Oso, A.O., Sobayo, R.A., Falola, A.C., Osho, S.O. and O.M Sogunle (2012). Control of salmonella organisms in laying hens through the use of feed additives. Nigeria Poultry Science Journal 9: 166-171. -Olorunsola R.A, Eruvbetine D, Oyekunle M.A, Jegede A.V and  Ogunade I.M (2012); Salmonella organism transmission in hatching broiler eggs, Journal of Biology, Agriculture and Healthcare, Vol 2, No 10. -I.B Allison, D.A Ekunseitan, A.A Ayoola, S.O Iposu, O.M.O Idowu, I.M Ogunade and S.O Osho (2013). Effect of beak amputation and sex on the pecking rate damage and performance parameters of turkey. Paskitan Journal of Biological Sciences 16(19): 1022-1027. -R.A. Sobayo., A. O. Oso, O.A. Adeyemi., O.G. Sodipe, A.O. Fafiolu, Odetola, O.M and I.M. Ogunade. 2013. Growth response and nutrient digestibility of broiler chicken fed graded levels of phytobiotics (Garcinia kola; Bitter kola). Journal of Applied Agricultural Research 5(1), 91-99. Official Publication of Agricultural Research Institute, Nigeria. -A. O. Oso, A. S. Haastrup, A. J. Ajibade, K.O. Olowonefa, A.O. Aluko,  I.M. Ogunade, S.O. Osho, A.M. Bamgbose. (2013). Growth performance, apparent nutrient digestibility, caecal fermentation, ileal morphology and caecal microflora of growing rabbits fed diet containing probiotics and prebiotics. Livestock Science. 157: 184-190. -Oso, A. O, G.A. Williams, A.V. Jegede, R.A. Sobayo, A.O. Fafiolu, O.M.O. Idowu, M. O. Sogunle, O.S. Akinola, O.O. Adeleye, l A.R. Olorunsola, I.M. Ogunade, S.O. Osho, F.O. Obadire, A.M Bamgbose. 2014. Interactive effect of whole millet feeding and mannan oligossaccharides supplementation on growth performance, serum biochemistry and organ weights of helmeted guinea fowl (Numidia meleagris). Livestock Science 159: 46-52. -Osho, S.O., Oso, A.O., Akpan, I.E., Ayanniyi, T.A., Ogunade, I.M., Durosaro, S.O. and Idowu, O.M.O. (2013). Health status and blood parameters of weaner rabbits fed diets containing varying dietary fibre and digestible energy levels. Journal of Biology, Agriculture and Healthcare. 3(19): 79-86. Published by International Institute for Science, Technology and Education, UNITED STATES OF AMERICA. -Durosaro, S.O., Ojo, A., Fadare, A.O., Olowofeso, O., Ilori, B.M., Osho, S.O., Ogunade,  I.M. and Ozoje, M.O. (2013). Effect of Coat Colour on Water Intake and Feed Utilization of Intensively Reared West African Dwarf Sheep in the Humid Tropics. Journal of Biology, Agriculture and Healthcare. 3(19): 31-37. Published by International Institute for Science, Technology and Education, UNITED STATES OF AMERICA. -Ekunseitan, D.A., Balogun, O.O., Eruvbetine, Daisy, Abiola, S.S., Sogunle, O.M., Ogunade, I.M., Egbeyale, L.T., Ayoola, A.A., Akinola, O.F., Allison, I.B. and Osho, S.O. (2012). Visual assessment, proximate composition and cost analysis of three differently processed discarded vegetable-bovine blood-rumen content mixtures as substitutes for conventional feedstuffs. Short Communication Nigerian Journal of Animal Production 39(2):211-217. Conference Papers -Ibukun M. Ogunade, Kathy G. Arriola, Rafael M. Martins, Bibiana Y. Coy, Chelsea L. Curry, Deborah K. Terkoski, Amber Rubright, Marcos G. Zenobi, Zhengxin Ma, Charles R. Staples, Adegbola T. Adesogan (2014). Effect of prototype sequestering agents on performance and milk aflatoxin M1 concentrations of dairy cows fed aflatoxin B1-contaminated diets. ADSA-ASAS-CSAS Joint Annual Meeting, Missouri, USA 07/2014 -O. Oso, O. Erinle, A.V. Jegede, A.O. Fafiolu, R.A. Sobayo, R. Olorunsola, A.M. Bamgbose, I.M. Ogunade, S.O. Osho, W.A. Olayemi, F.O. Oke. (2013). Effect of whole millet feeding and mannan oligosaccharides supplementation on organ weights of Cockerel Chicks. WPSA (UK Branch) Annual Meeting 16th-17th April 2013. The Jubilee Campus, Nottingham University. UNITED KINGDOM -Ogunade, I.M., Eruvbetine D, Fafiolu, A. O., Oyekunle, M.A, Oso, A.O, Sobayo, R.A, Osho S.O, Ekunseitan D.A. 2012. Effect of dietary mannan oligosaccharides on the prevalence of Salmonella organisms in the dropping of sampled laying hens within South-Western Nigeria. World's Poultry Science Association (UK Branch) Annual meeting 24-25th April, pg 35 Jubilee Campus, Nottingham University. British Poultry Abstracts 8 (1):44-45. UNITED KINGDOM Skills -Great Organizational skills -Good Numerical and analytical skills",
    "emails": [],
    "entities": [
        "University of Florida International Center Master of Science",
        "Short Communication Nigerian Journal of Animal Production",
        "Oyekunle",
        "fed",
        "A.R. Olorunsola",
        "the University -Dufil Prima Schloarship",
        "Journal of Biology",
        "S.O.",
        "O.O. Adeleye",
        "Fafiolu",
        "Osho S.O",
        "-Certificate",
        "GRADUATE RESEARCH",
        "Odetola",
        "Fadare",
        "ADSA-ASAS-CSAS Joint Annual Meeting",
        "I.M. Ogunade",
        "Affiliations Nigerian Society of Animal Production American Society of Animal Science Publications Peer",
        "Healthcare",
        "O.S. Akinola",
        "Nottingham University",
        "World's",
        "University of Agriculture   City",
        "UNITED KINGDOM Skills -Great Organizational",
        "Oyekunle M.A",
        "Durosaro",
        "R.A",
        "USA Awards -Grinter Fellowship",
        "Poultry Science Association",
        "S.O. Osho",
        "O.G. Sodipe",
        "Ozoje",
        "O.M.O. Idowu",
        "University of Agriculture",
        "Cockerel Chicks",
        "I.M.",
        "Professional Experience Graduate Research",
        "International Institute for Science, Technology and Education",
        "Salmonella",
        "UK Branch",
        "O.M.O Idowu",
        "the Humid Tropics",
        "S.O. and Idowu",
        "I.E.",
        "Areas of Expertise Dairy Nutrition Food Safety Feed",
        "State",
        "A.O. Fafiolu",
        "Official Publication of Agricultural Research Institute",
        "British Poultry Abstracts",
        "Nigeria Poultry Science Journal",
        "Paskitan Journal of Biological Sciences",
        "Ekunseitan D.A. 2012",
        "Applied Agricultural Research",
        "Allison,",
        "University of Florida",
        "F.O. Oke",
        "O.F."
    ],
    "experience": "Experience Graduate Research Assistant    07/2013    to   Current    Company Name    City    ,   State Ongoing Researches -Effect of prototype sequestering agents on performance and milk aflatoxin M1 concentrations of dairy cows fed aflatoxin B1 - contaminated diets . -The effect of selected lactic acid bacteria on the microbial composition and on the survival of pathogens in the rumen in context with their probiotic effects on ruminants -An in - vitro study on the use of tropical plants and essential oils in mitigating methanogenesis in ruminant . Assistant Lecturer    08/2010    to   06/2013    Company Name    City    ,   State -Instructed a class of 156 students in animal feed and feeding course -Lectured and communicated effectively with students from diverse backgroups -Inspired students to translate their academic interests into the real world by taking positive actions Education Ph.D.    :   Ruminant Nutrition    2017    University of Florida    City    ,   State    ,   USA Awards -Grinter Fellowship for outstanding new PhD students -Certificate of outstanding academic achievement , University of Florida International Center Master of Science    :   Monogastric Nutrition    2011    University of Agriculture    City    ,   State    ,   Nigeria Awards -University of Agriculture Graduate Fellowship -Postgraduate Tuition Scholarship for First Class Students in the University -Dufil Prima Schloarship for postgraduate students in Nutrition Bachelor of Agriculture    :   Animal Nutrition    2009    University of Agriculture , Abeokuta    City    ,   State    ,   Nigeria Award Academic achievement award for graduating with a First class ... 4.59 out of 5.00 . Affiliations Nigerian Society of Animal Production American Society of Animal Science Publications Peer - reviewed Publications -C. M. Huisden , N. J. Szabo ,   I.M. Ogunade and A. T. Adesogan ( 2014 ) . Mucuna pruriens detoxification : 1 . Effects of ensiling duration and particle size . Animal Feed Science and Technology . ( IN PRESS ) . -Ogunade I.M. , Eruvbetine . , D. , Oyekunle , A.O , Fafiolu , A.O , Olorunsola , R.A. , Oso , A.O. , Sobayo , R.A. , Falola , A.C. , Osho , S.O. and O.M Sogunle ( 2012 ) . Control of salmonella organisms in laying hens through the use of feed additives . Nigeria Poultry Science Journal 9 : 166 - 171 . -Olorunsola R.A , Eruvbetine D , Oyekunle M.A , Jegede A.V and   Ogunade I.M ( 2012 ) ; Salmonella organism transmission in hatching broiler eggs , Journal of Biology , Agriculture and Healthcare , Vol 2 , No 10 . -I.B Allison , D.A Ekunseitan , A.A Ayoola , S.O Iposu , O.M.O Idowu , I.M Ogunade and S.O Osho ( 2013 ) . Effect of beak amputation and sex on the pecking rate damage and performance parameters of turkey . Paskitan Journal of Biological Sciences 16(19 ): 1022 - 1027 . -R.A. Sobayo . , A. O. Oso , O.A. Adeyemi . , O.G. Sodipe , A.O. Fafiolu , Odetola , O.M and I.M. Ogunade . 2013 . Growth response and nutrient digestibility of broiler chicken fed graded levels of phytobiotics ( Garcinia kola ; Bitter kola ) . Journal of Applied Agricultural Research 5(1 ) , 91 - 99 . Official Publication of Agricultural Research Institute , Nigeria . -A. O. Oso , A. S. Haastrup , A. J. Ajibade , K.O. Olowonefa , A.O. Aluko ,   I.M. Ogunade , S.O. Osho , A.M. Bamgbose . ( 2013 ) . Growth performance , apparent nutrient digestibility , caecal fermentation , ileal morphology and caecal microflora of growing rabbits fed diet containing probiotics and prebiotics . Livestock Science . 157 : 184 - 190 . -Oso , A. O , G.A. Williams , A.V. Jegede , R.A. Sobayo , A.O. Fafiolu , O.M.O. Idowu , M. O. Sogunle , O.S. Akinola , O.O. Adeleye , l A.R. Olorunsola , I.M. Ogunade , S.O. Osho , F.O. Obadire , A.M Bamgbose . 2014 . Interactive effect of whole millet feeding and mannan oligossaccharides supplementation on growth performance , serum biochemistry and organ weights of helmeted guinea fowl ( Numidia meleagris ) . Livestock Science 159 : 46 - 52 . -Osho , S.O. , Oso , A.O. , Akpan , I.E. , Ayanniyi , T.A. , Ogunade , I.M. , Durosaro , S.O. and Idowu , O.M.O. ( 2013 ) . Health status and blood parameters of weaner rabbits fed diets containing varying dietary fibre and digestible energy levels . Journal of Biology , Agriculture and Healthcare . 3(19 ): 79 - 86 . Published by International Institute for Science , Technology and Education , UNITED STATES OF AMERICA . -Durosaro , S.O. , Ojo , A. , Fadare , A.O. , Olowofeso , O. , Ilori , B.M. , Osho , S.O. , Ogunade ,   I.M. and Ozoje , M.O. ( 2013 ) . Effect of Coat Colour on Water Intake and Feed Utilization of Intensively Reared West African Dwarf Sheep in the Humid Tropics . Journal of Biology , Agriculture and Healthcare . 3(19 ): 31 - 37 . Published by International Institute for Science , Technology and Education , UNITED STATES OF AMERICA . -Ekunseitan , D.A. , Balogun , O.O. , Eruvbetine , Daisy , Abiola , S.S. , Sogunle , O.M. , Ogunade , I.M. , Egbeyale , L.T. , Ayoola , A.A. , Akinola , O.F. , Allison , I.B. and Osho , S.O. ( 2012 ) . Visual assessment , proximate composition and cost analysis of three differently processed discarded vegetable - bovine blood - rumen content mixtures as substitutes for conventional feedstuffs . Short Communication Nigerian Journal of Animal Production 39(2):211 - 217 . Conference Papers -Ibukun M. Ogunade , Kathy G. Arriola , Rafael M. Martins , Bibiana Y. Coy , Chelsea L. Curry , Deborah K. Terkoski , Amber Rubright , Marcos G. Zenobi , Zhengxin Ma , Charles R. Staples , Adegbola T. Adesogan ( 2014 ) . Effect of prototype sequestering agents on performance and milk aflatoxin M1 concentrations of dairy cows fed aflatoxin B1 - contaminated diets . ADSA - ASAS - CSAS Joint Annual Meeting , Missouri , USA 07/2014 -O. Oso , O. Erinle , A.V. Jegede , A.O. Fafiolu , R.A. Sobayo , R. Olorunsola , A.M. Bamgbose , I.M. Ogunade , S.O. Osho , W.A. Olayemi , F.O. Oke . ( 2013 ) . Effect of whole millet feeding and mannan oligosaccharides supplementation on organ weights of Cockerel Chicks . WPSA ( UK Branch ) Annual Meeting 16th-17th April 2013 . The Jubilee Campus , Nottingham University . UNITED KINGDOM -Ogunade , I.M. , Eruvbetine D , Fafiolu , A. O. , Oyekunle , M.A , Oso , A.O , Sobayo , R.A , Osho S.O , Ekunseitan D.A. 2012 . Effect of dietary mannan oligosaccharides on the prevalence of Salmonella organisms in the dropping of sampled laying hens within South - Western Nigeria . World 's Poultry Science Association ( UK Branch ) Annual meeting 24 - 25th April , pg 35 Jubilee Campus , Nottingham University . British Poultry Abstracts 8 ( 1):44 - 45 . UNITED KINGDOM Skills -Great Organizational skills -Good Numerical and analytical skills",
    "extracted_keywords": [
        "GRADUATE",
        "RESEARCH",
        "ASSISTANT",
        "Profile",
        "Results",
        "Animal",
        "Nutritionist",
        "research",
        "teaching",
        "experience",
        "Areas",
        "Expertise",
        "Dairy",
        "Nutrition",
        "Food",
        "Safety",
        "Feed",
        "supplementation",
        "strategies",
        "Professional",
        "Experience",
        "Graduate",
        "Research",
        "Assistant",
        "07/2013",
        "Current",
        "Company",
        "Name",
        "City",
        "State",
        "Ongoing",
        "Researches",
        "-Effect",
        "prototype",
        "sequestering",
        "agents",
        "performance",
        "milk",
        "aflatoxin",
        "M1",
        "concentrations",
        "dairy",
        "cows",
        "aflatoxin",
        "B1",
        "diets",
        "effect",
        "acid",
        "bacteria",
        "composition",
        "survival",
        "pathogens",
        "rumen",
        "context",
        "effects",
        "ruminants",
        "study",
        "use",
        "plants",
        "oils",
        "methanogenesis",
        "ruminant",
        "Assistant",
        "Lecturer",
        "08/2010",
        "06/2013",
        "Company",
        "Name",
        "City",
        "State",
        "class",
        "students",
        "animal",
        "feed",
        "course",
        "students",
        "students",
        "interests",
        "world",
        "actions",
        "Education",
        "Ph.D.",
        "Ruminant",
        "Nutrition",
        "University",
        "Florida",
        "City",
        "State",
        "USA",
        "Awards",
        "-Grinter",
        "Fellowship",
        "PhD",
        "students",
        "achievement",
        "University",
        "Florida",
        "International",
        "Center",
        "Master",
        "Science",
        "Monogastric",
        "Nutrition",
        "University",
        "Agriculture",
        "City",
        "State",
        "Nigeria",
        "Awards",
        "-University",
        "Agriculture",
        "Graduate",
        "Fellowship",
        "-Postgraduate",
        "Tuition",
        "Scholarship",
        "First",
        "Class",
        "Students",
        "University",
        "-Dufil",
        "Prima",
        "Schloarship",
        "students",
        "Nutrition",
        "Bachelor",
        "Agriculture",
        "Animal",
        "Nutrition",
        "University",
        "Agriculture",
        "Abeokuta",
        "City",
        "State",
        "Nigeria",
        "Award",
        "Academic",
        "achievement",
        "award",
        "class",
        "Affiliations",
        "Nigerian",
        "Society",
        "Animal",
        "Production",
        "American",
        "Society",
        "Animal",
        "Science",
        "Publications",
        "Peer",
        "Publications",
        "-C.",
        "M.",
        "Huisden",
        "N.",
        "J.",
        "Szabo",
        "I.M.",
        "Ogunade",
        "A.",
        "T.",
        "Adesogan",
        "Mucuna",
        "detoxification",
        "Effects",
        "duration",
        "particle",
        "size",
        "Animal",
        "Feed",
        "Science",
        "Technology",
        "PRESS",
        "-Ogunade",
        "I.M.",
        "Eruvbetine",
        ".",
        "D.",
        "Oyekunle",
        "A.O",
        "Fafiolu",
        "A.O",
        "Olorunsola",
        "R.A.",
        "Oso",
        "A.O.",
        "Sobayo",
        "R.A.",
        "Falola",
        "A.C.",
        "Osho",
        "S.O.",
        "O.M",
        "Sogunle",
        "Control",
        "salmonella",
        "organisms",
        "hens",
        "use",
        "feed",
        "additives",
        "Nigeria",
        "Poultry",
        "Science",
        "Journal",
        "-Olorunsola",
        "R.A",
        "Eruvbetine",
        "D",
        "Oyekunle",
        "M.A",
        "Jegede",
        "A.V",
        "Ogunade",
        "I.M",
        "Salmonella",
        "organism",
        "transmission",
        "broiler",
        "eggs",
        "Journal",
        "Biology",
        "Agriculture",
        "Healthcare",
        "Vol",
        "Allison",
        "D.A",
        "Ekunseitan",
        "A.A",
        "Ayoola",
        "S.O",
        "Iposu",
        "O.M.O",
        "Idowu",
        "I.M",
        "Ogunade",
        "S.O",
        "Osho",
        "Effect",
        "beak",
        "amputation",
        "sex",
        "pecking",
        "rate",
        "damage",
        "performance",
        "parameters",
        "turkey",
        "Paskitan",
        "Journal",
        "Biological",
        "Sciences",
        "-R.A.",
        "Sobayo",
        ".",
        "A.",
        "O.",
        "Oso",
        "O.A.",
        "Adeyemi",
        "O.G.",
        "Sodipe",
        "A.O.",
        "Fafiolu",
        "Odetola",
        "O.M",
        "I.M.",
        "Ogunade",
        "Growth",
        "response",
        "digestibility",
        "broiler",
        "chicken",
        "fed",
        "levels",
        "phytobiotics",
        "Garcinia",
        "kola",
        "kola",
        "Journal",
        "Applied",
        "Agricultural",
        "Research",
        "Official",
        "Publication",
        "Agricultural",
        "Research",
        "Institute",
        "Nigeria",
        "-A.",
        "O.",
        "Oso",
        "A.",
        "S.",
        "Haastrup",
        "A.",
        "J.",
        "Ajibade",
        "K.O.",
        "Olowonefa",
        "A.O.",
        "Aluko",
        "I.M.",
        "Ogunade",
        "S.O.",
        "Osho",
        "A.M.",
        "Bamgbose",
        "Growth",
        "performance",
        "digestibility",
        "fermentation",
        "morphology",
        "microflora",
        "rabbits",
        "fed",
        "diet",
        "probiotics",
        "prebiotics",
        "Livestock",
        "Science",
        "A.",
        "O",
        "G.A.",
        "Williams",
        "A.V.",
        "Jegede",
        "R.A.",
        "Sobayo",
        "A.O.",
        "Fafiolu",
        "O.M.O.",
        "Idowu",
        "M.",
        "O.",
        "Sogunle",
        "O.S.",
        "Akinola",
        "O.O.",
        "Adeleye",
        "l",
        "A.R.",
        "Olorunsola",
        "I.M.",
        "Ogunade",
        "S.O.",
        "Osho",
        "F.O.",
        "Obadire",
        "A.M",
        "Bamgbose",
        "effect",
        "millet",
        "feeding",
        "mannan",
        "oligossaccharides",
        "supplementation",
        "growth",
        "performance",
        "serum",
        "biochemistry",
        "weights",
        "guinea",
        "fowl",
        "Numidia",
        "meleagris",
        "Livestock",
        "Science",
        "-Osho",
        "S.O.",
        "Oso",
        "A.O.",
        "Akpan",
        "I.E.",
        "Ayanniyi",
        "T.A.",
        "Ogunade",
        "I.M.",
        "Durosaro",
        "S.O.",
        "Idowu",
        "O.M.O.",
        "Health",
        "status",
        "blood",
        "parameters",
        "weaner",
        "rabbits",
        "diets",
        "fibre",
        "energy",
        "levels",
        "Journal",
        "Biology",
        "Agriculture",
        "Healthcare",
        "International",
        "Institute",
        "Science",
        "Technology",
        "Education",
        "UNITED",
        "STATES",
        "AMERICA",
        "-Durosaro",
        "S.O.",
        "Ojo",
        "A.",
        "Fadare",
        "A.O.",
        "Olowofeso",
        "O.",
        "Ilori",
        "B.M.",
        "Osho",
        "S.O.",
        "Ogunade",
        "I.M.",
        "Ozoje",
        "M.O.",
        "Effect",
        "Coat",
        "Colour",
        "Water",
        "Intake",
        "Feed",
        "Utilization",
        "Reared",
        "Dwarf",
        "Sheep",
        "Humid",
        "Tropics",
        "Journal",
        "Biology",
        "Agriculture",
        "Healthcare",
        "International",
        "Institute",
        "Science",
        "Technology",
        "Education",
        "UNITED",
        "STATES",
        "AMERICA",
        "-Ekunseitan",
        "D.A.",
        "Balogun",
        "O.O.",
        "Eruvbetine",
        "Daisy",
        "Abiola",
        "S.S.",
        "Sogunle",
        "O.M.",
        "Ogunade",
        "I.M.",
        "Egbeyale",
        "L.T.",
        "Ayoola",
        "A.A.",
        "Akinola",
        "O.F.",
        "Allison",
        "I.B.",
        "Osho",
        "S.O.",
        "assessment",
        "proximate",
        "composition",
        "cost",
        "analysis",
        "vegetable",
        "bovine",
        "blood",
        "rumen",
        "content",
        "mixtures",
        "substitutes",
        "feedstuffs",
        "Communication",
        "Nigerian",
        "Journal",
        "Animal",
        "Production",
        "39(2):211",
        "Conference",
        "Papers",
        "-Ibukun",
        "M.",
        "Ogunade",
        "Kathy",
        "G.",
        "Arriola",
        "Rafael",
        "M.",
        "Martins",
        "Bibiana",
        "Y.",
        "Coy",
        "Chelsea",
        "L.",
        "Curry",
        "Deborah",
        "K.",
        "Terkoski",
        "Amber",
        "Rubright",
        "Marcos",
        "G.",
        "Zenobi",
        "Zhengxin",
        "Ma",
        "Charles",
        "R.",
        "Staples",
        "Adegbola",
        "T.",
        "Adesogan",
        "Effect",
        "prototype",
        "sequestering",
        "agents",
        "performance",
        "milk",
        "aflatoxin",
        "M1",
        "concentrations",
        "dairy",
        "cows",
        "aflatoxin",
        "B1",
        "diets",
        "ASAS",
        "CSAS",
        "Joint",
        "Annual",
        "Meeting",
        "Missouri",
        "USA",
        "07/2014",
        "-O.",
        "Oso",
        "O.",
        "Erinle",
        "A.V.",
        "Jegede",
        "A.O.",
        "Fafiolu",
        "R.A.",
        "Sobayo",
        "R.",
        "Olorunsola",
        "A.M.",
        "Bamgbose",
        "I.M.",
        "Ogunade",
        "S.O.",
        "Osho",
        "W.A.",
        "Olayemi",
        "F.O.",
        "Oke",
        "Effect",
        "millet",
        "feeding",
        "mannan",
        "supplementation",
        "organ",
        "weights",
        "Cockerel",
        "Chicks",
        "WPSA",
        "UK",
        "Branch",
        "Annual",
        "Meeting",
        "April",
        "Jubilee",
        "Campus",
        "Nottingham",
        "University",
        "UNITED",
        "KINGDOM",
        "-Ogunade",
        "I.M.",
        "Eruvbetine",
        "D",
        "Fafiolu",
        "A.",
        "O.",
        "Oyekunle",
        "M.A",
        "Oso",
        "A.O",
        "Sobayo",
        "R.A",
        "Osho",
        "S.O",
        "Ekunseitan",
        "D.A.",
        "Effect",
        "mannan",
        "prevalence",
        "Salmonella",
        "organisms",
        "dropping",
        "hens",
        "South",
        "Western",
        "Nigeria",
        "World",
        "Poultry",
        "Science",
        "Association",
        "UK",
        "Branch",
        "meeting",
        "25th",
        "April",
        "pg",
        "Jubilee",
        "Campus",
        "Nottingham",
        "University",
        "British",
        "Poultry",
        "Abstracts",
        "UNITED",
        "KINGDOM",
        "Skills",
        "skills",
        "-Good",
        "Numerical",
        "skills"
    ],
    "keyterms": [
        [
            "I.M. Ogunade",
            0.09628124353149488
        ],
        [
            "Animal",
            0.04706259399621801
        ],
        [
            "S.O. Osho",
            0.03970099139612048
        ],
        [
            "A.O. Fafiolu",
            0.03394083104745022
        ],
        [
            "Nutrition",
            0.031605924786616245
        ],
        [
            "effect",
            0.029463678832364542
        ],
        [
            "City",
            0.02784674951752969
        ],
        [
            "Science",
            0.02117210544437712
        ],
        [
            "performance",
            0.02051376411867607
        ],
        [
            "Agriculture",
            0.0195325921901129
        ],
        [
            "student",
            0.018759990498541115
        ],
        [
            "Research",
            0.018523375532175625
        ],
        [
            "University",
            0.018339899137618344
        ],
        [
            "diet",
            0.015071777373492547
        ],
        [
            "aflatoxin",
            0.01493356538219422
        ],
        [
            "Graduate",
            0.014887764995690356
        ],
        [
            "state",
            0.014641072379641651
        ],
        [
            "supplementation",
            0.014165528143678214
        ],
        [
            "Assistant",
            0.012170437704815143
        ],
        [
            "use",
            0.011864869361908536
        ]
    ],
    "phones": [],
    "resume_data": "GRADUATE RESEARCH ASSISTANT\nProfile\nResults-driven Animal Nutritionist with good research and teaching experience\nAreas of Expertise\nDairy Nutrition\nFood Safety\nFeed supplementation strategies\nProfessional Experience\nGraduate Research Assistant\n \n07/2013\n \nto \nCurrent\n \nCompany Name\n \nCity\n \n, \nState\nOngoing Researches\n-Effect of prototype sequestering agents on performance and milk aflatoxin M1 concentrations of dairy cows fed aflatoxin B1-contaminated diets.\n-The effect of selected lactic acid bacteria on the microbial composition and on the survival of pathogens in the rumen in context with their\nprobiotic effects on ruminants\n-An in-vitro study on the use of tropical plants and essential oils in mitigating methanogenesis in ruminant.\nAssistant Lecturer\n \n08/2010\n \nto \n06/2013\n \nCompany Name\n \nCity\n \n, \nState\n-Instructed a class of 156 students in animal feed and feeding course\n-Lectured and communicated effectively with students from diverse backgroups\n-Inspired students to translate their academic interests into the real world by taking positive actions\nEducation\nPh.D.\n \n: \nRuminant Nutrition\n \n2017\n \nUniversity of Florida\n \nCity\n \n, \nState\n \n, \nUSA\nAwards\n-Grinter Fellowship for outstanding new PhD students\n-Certificate of outstanding academic achievement, University of Florida International Center\nMaster of Science\n \n: \nMonogastric Nutrition\n \n2011\n \nUniversity of Agriculture\n \nCity\n \n, \nState\n \n, \nNigeria\nAwards\n-University of Agriculture Graduate Fellowship\n-Postgraduate Tuition Scholarship for First Class Students in the University\n-Dufil Prima Schloarship for postgraduate students in Nutrition\nBachelor of Agriculture\n \n: \nAnimal Nutrition\n \n2009\n \nUniversity of Agriculture, Abeokuta\n \nCity\n \n, \nState\n \n, \nNigeria\nAward\nAcademic achievement award for graduating with a First class...4.59 out of 5.00.\nAffiliations\nNigerian Society of Animal Production\nAmerican Society of Animal Science\nPublications\nPeer-reviewed Publications\n-C. M. Huisden, N. J. Szabo, \nI.M. Ogunade and A. T. Adesogan (2014). Mucuna pruriens detoxification: 1. Effects of ensiling duration and\nparticle size. Animal Feed Science and Technology. (IN PRESS). -Ogunade I.M., Eruvbetine., D., Oyekunle, A.O, Fafiolu, A.O, Olorunsola, R.A., Oso, A.O., Sobayo, R.A., Falola, A.C., Osho, S.O. and O.M\nSogunle (2012). Control of salmonella organisms in laying hens through the use of feed additives. Nigeria Poultry Science Journal 9: 166-171.\n-Olorunsola R.A, Eruvbetine D, Oyekunle M.A, Jegede A.V and \nOgunade I.M (2012); Salmonella organism transmission in hatching broiler eggs,\nJournal of Biology, Agriculture and Healthcare, Vol 2, No 10.\n-I.B Allison, D.A Ekunseitan, A.A Ayoola, S.O Iposu, O.M.O Idowu, I.M Ogunade and S.O Osho (2013). Effect of beak amputation and sex\non the pecking rate damage and performance parameters of turkey. Paskitan Journal of Biological Sciences 16(19): 1022-1027.\n-R.A. Sobayo., A. O. Oso, O.A. Adeyemi., O.G. Sodipe, A.O. Fafiolu, Odetola, O.M and I.M. Ogunade. 2013. Growth response and nutrient\ndigestibility of broiler chicken fed graded levels of phytobiotics (Garcinia kola; Bitter kola). Journal of Applied Agricultural Research 5(1), 91-99.\nOfficial Publication of Agricultural Research Institute, Nigeria.\n-A. O. Oso, A. S. Haastrup, A. J. Ajibade, K.O. Olowonefa, A.O. Aluko, \nI.M. Ogunade, S.O. Osho, A.M. Bamgbose. (2013). Growth\nperformance, apparent nutrient digestibility, caecal fermentation, ileal morphology and caecal microflora of growing rabbits fed diet containing\nprobiotics and prebiotics. Livestock Science. 157: 184-190.\n-Oso, A. O, G.A. Williams, A.V. Jegede, R.A. Sobayo, A.O. Fafiolu, O.M.O. Idowu, M. O. Sogunle, O.S. Akinola, O.O. Adeleye, l A.R.\nOlorunsola, I.M. Ogunade, S.O. Osho, F.O. Obadire, A.M Bamgbose. 2014. Interactive effect of whole millet feeding and mannan\noligossaccharides supplementation on growth performance, serum biochemistry and organ weights of helmeted guinea fowl (Numidia meleagris).\nLivestock Science 159: 46-52.\n-Osho, S.O., Oso, A.O., Akpan, I.E., Ayanniyi, T.A., Ogunade, I.M., Durosaro, S.O. and Idowu, O.M.O. (2013). Health status and blood\nparameters of weaner rabbits fed diets containing varying dietary fibre and digestible energy levels. Journal of Biology, Agriculture and Healthcare.\n3(19): 79-86. Published by International Institute for Science, Technology and Education, UNITED STATES OF AMERICA.\n-Durosaro, S.O., Ojo, A., Fadare, A.O., Olowofeso, O., Ilori, B.M., Osho, S.O., Ogunade, \nI.M. and Ozoje, M.O. (2013). Effect of Coat\nColour on Water Intake and Feed Utilization of Intensively Reared West African Dwarf Sheep in the Humid Tropics. Journal of Biology,\nAgriculture and Healthcare. 3(19): 31-37. Published by International Institute for Science, Technology and Education, UNITED STATES OF\nAMERICA.\n-Ekunseitan, D.A., Balogun, O.O., Eruvbetine, Daisy, Abiola, S.S., Sogunle, O.M., Ogunade, I.M., Egbeyale, L.T., Ayoola, A.A., Akinola,\nO.F., Allison, I.B. and Osho, S.O. (2012). Visual assessment, proximate composition and cost analysis of three differently processed discarded\nvegetable-bovine blood-rumen content mixtures as substitutes for conventional feedstuffs. Short Communication Nigerian Journal of Animal\nProduction 39(2):211-217.\nConference Papers\n-Ibukun M. Ogunade, Kathy G. Arriola, Rafael M. Martins, Bibiana Y. Coy, Chelsea L. Curry, Deborah K. Terkoski, Amber Rubright, Marcos\nG. Zenobi, Zhengxin Ma, Charles R. Staples, Adegbola T. Adesogan (2014). Effect of prototype sequestering agents on performance and milk\naflatoxin M1 concentrations of dairy cows fed aflatoxin B1-contaminated diets. ADSA-ASAS-CSAS Joint Annual Meeting, Missouri, USA\n07/2014\n-O. Oso, O. Erinle, A.V. Jegede, A.O. Fafiolu, R.A. Sobayo, R. Olorunsola, A.M. Bamgbose, I.M. Ogunade, S.O. Osho, W.A. Olayemi, F.O.\nOke. (2013). Effect of whole millet feeding and mannan oligosaccharides supplementation on organ weights of Cockerel Chicks. WPSA (UK\nBranch) Annual Meeting 16th-17th April 2013. The Jubilee Campus, Nottingham University. UNITED KINGDOM -Ogunade, I.M., Eruvbetine D, Fafiolu, A. O., Oyekunle, M.A, Oso, A.O, Sobayo, R.A, Osho S.O, Ekunseitan D.A. 2012. Effect of dietary\nmannan oligosaccharides on the prevalence of Salmonella organisms in the dropping of sampled laying hens within South-Western Nigeria. World's\nPoultry Science Association (UK Branch) Annual meeting 24-25th April, pg 35 Jubilee Campus, Nottingham University. British Poultry Abstracts\n8 (1):44-45. UNITED KINGDOM\nSkills\n-Great Organizational skills\n-Good Numerical and analytical skills",
    "tri_grams": "[GRADUATE RESEARCH ASSISTANT, RESEARCH ASSISTANT Profile, ASSISTANT Profile Results, driven Animal Nutritionist, Nutritionist with good, research and teaching, teaching experience Areas, Areas of Expertise, Expertise Dairy Nutrition, Dairy Nutrition Food, Nutrition Food Safety, Food Safety Feed, Safety Feed supplementation, Feed supplementation strategies, supplementation strategies Professional, strategies Professional Experience, Professional Experience Graduate, Experience Graduate Research, Graduate Research Assistant, State Ongoing Researches, Ongoing Researches -Effect, -Effect of prototype, prototype sequestering agents, agents on performance, performance and milk, milk aflatoxin M1, aflatoxin M1 concentrations, concentrations of dairy, dairy cows fed, cows fed aflatoxin, fed aflatoxin B1, effect of selected, selected lactic acid, lactic acid bacteria, survival of pathogens, rumen in context, effects on ruminants, use of tropical, plants and essential, oils in mitigating, methanogenesis in ruminant, -Instructed a class, students in animal, feed and feeding, feeding course -Lectured, -Lectured and communicated, effectively with students, students from diverse, diverse backgroups -Inspired, backgroups -Inspired students, students to translate, translate their academic, world by taking, taking positive actions, positive actions Education, actions Education Ph.D., University of Florida, USA Awards -Grinter, Awards -Grinter Fellowship, Fellowship for outstanding, outstanding new PhD, new PhD students, PhD students -Certificate, -Certificate of outstanding, outstanding academic achievement, University of Florida, Florida International Center, International Center Master, Master of Science, University of Agriculture, Nigeria Awards -University, -University of Agriculture, Agriculture Graduate Fellowship, Graduate Fellowship -Postgraduate, Fellowship -Postgraduate Tuition, -Postgraduate Tuition Scholarship, University -Dufil Prima, -Dufil Prima Schloarship, Schloarship for postgraduate, students in Nutrition, Bachelor of Agriculture, University of Agriculture, Nigeria Award Academic, Award Academic achievement, Academic achievement award, award for graduating, Affiliations Nigerian Society, Society of Animal, Animal Production American, Production American Society, Society of Animal, Animal Science Publications, Science Publications Peer, reviewed Publications -C., Publications -C. M., -C. M. Huisden, N. J. Szabo, Ogunade and A., A. T. Adesogan, Mucuna pruriens detoxification, Effects of ensiling, duration and particle, Animal Feed Science, Science and Technology, S.O. and O.M, Control of salmonella, organisms in laying, use of feed, Nigeria Poultry Science, Poultry Science Journal, Salmonella organism transmission, transmission in hatching, hatching broiler eggs, Journal of Biology, Agriculture and Healthcare, Ogunade and S.O, Effect of beak, amputation and sex, pecking rate damage, damage and performance, parameters of turkey, Journal of Biological, Biological Sciences 16(19, A. O. Oso, O.M and I.M., response and nutrient, digestibility of broiler, broiler chicken fed, chicken fed graded, fed graded levels, levels of phytobiotics, Journal of Applied, Applied Agricultural Research, Agricultural Research 5(1, Publication of Agricultural, Agricultural Research Institute, -A. O. Oso, A. S. Haastrup, A. J. Ajibade, apparent nutrient digestibility, morphology and caecal, microflora of growing, growing rabbits fed, rabbits fed diet, fed diet containing, diet containing probiotics, probiotics and prebiotics, M. O. Sogunle, l A.R. Olorunsola, feeding and mannan, mannan oligossaccharides supplementation, supplementation on growth, biochemistry and organ, weights of helmeted, helmeted guinea fowl, S.O. and Idowu, status and blood, parameters of weaner, weaner rabbits fed, rabbits fed diets, fed diets containing, diets containing varying, containing varying dietary, varying dietary fibre, fibre and digestible, digestible energy levels, Journal of Biology, Agriculture and Healthcare, Published by International, Institute for Science, Technology and Education, STATES OF AMERICA, I.M. and Ozoje, Effect of Coat, Colour on Water, Intake and Feed, Utilization of Intensively, Intensively Reared West, Reared West African, West African Dwarf, African Dwarf Sheep, Journal of Biology, Agriculture and Healthcare, Published by International, Institute for Science, Technology and Education, STATES OF AMERICA, I.B. and Osho, composition and cost, differently processed discarded, processed discarded vegetable, rumen content mixtures, mixtures as substitutes, substitutes for conventional, Short Communication Nigerian, Communication Nigerian Journal, Journal of Animal, Animal Production 39(2):211, Conference Papers -Ibukun, Papers -Ibukun M., -Ibukun M. Ogunade, Kathy G. Arriola, Rafael M. Martins, Bibiana Y. Coy, Chelsea L. Curry, Deborah K. Terkoski, Marcos G. Zenobi, Charles R. Staples, Adegbola T. Adesogan, Effect of prototype, prototype sequestering agents, agents on performance, performance and milk, milk aflatoxin M1, aflatoxin M1 concentrations, concentrations of dairy, dairy cows fed, cows fed aflatoxin, fed aflatoxin B1, CSAS Joint Annual, Joint Annual Meeting, feeding and mannan, mannan oligosaccharides supplementation, supplementation on organ, weights of Cockerel, Annual Meeting 16th-17th, Meeting 16th-17th April, UNITED KINGDOM -Ogunade, Effect of dietary, dietary mannan oligosaccharides, prevalence of Salmonella, dropping of sampled, sampled laying hens, hens within South, World's Poultry, Poultry Science Association, British Poultry Abstracts, UNITED KINGDOM Skills, KINGDOM Skills -Great, Skills -Great Organizational, -Great Organizational skills, Organizational skills -Good, skills -Good Numerical, Numerical and analytical]",
    "unique_id": "696a73bb-7fc9-485e-b078-420edabdcd8d",
    "years": []
}