{
    "bi_grams": "[ENGINEERING SERVICES, SERVICES MANAGER, MANAGER Executive, Executive Profile, results driven, driven Controls, Controls Engineer, Project Manager, Industrial Automation, Process Engineering, strong mechanical, mechanical design, design background, Proven ability, motivate high, high performance, performance teams, building systems, improved functionality, consistently meeting, meeting critical, critical requirements, Skill Highlights, Highlights Proficient, process engineering, applying process, process needs, available technology, improve production, production availability, process engineering, applying process, process needs, available technology, improve production, production runablility, Professional Experience, Experience Engineering, Engineering Services, Services Manager, State Accountable, production manufacturing, manufacturing processes, processes required, high quality, quality product, cost effective, effective manner, provide overall, overall customer, customer satisfaction, engineering services, energy sources, mechanical repairs, resources engaged, Support waste, waste water, water operations, providing advanced, advanced troubleshooting, Siemens PLC, Configured WINCC, WINCC SCADA, SCADA system, Developed asset, asset management, management software, track cost, asset history, work order, order tracking, Performed advanced, advanced troubleshooting, PLC support, plant equipment, Electrical Superintendent, State Primary, Primary responsibilities, responsibilities include, include supervising, instrumentation activities, proper operation, production equipment, power distribution, distribution systems, plant communications, security systems, Managed projects, new equipment, design concept, Managed large, large network, Bradley PLC, including ControLogix, micro controllers, FactoryTalk View, SE human, human machine, machine interfaces, new projects, $1MM, HG Molenaar, Molenaar cooker, Buscetto steam, steam peeler, Navatta steam, steam peeler, Bellini diced, diced tomato, tomato filling, filling line, Perform advanced, advanced troubleshooting, PLC support, plant equipment, Trained electricians, instrument technicians, advanced VFD, VFD troubleshooting, PLC programming, process control, applicable regulations, regulations including, including NFPA, NFPA 70E, NEC codes, Project Manager, State Responsible, interpret proposed, proposed designs, initiate revisions, machine sections, time project, project completion, electrical assembly, meet customer, customer specs, Managed cross, functional teams, time installation, customers facilities, complete equipment, equipment installation, administered project, project budgets, fiscal controls, quality control, control provisions, Facility Supervisor, State Managed, maintenance personnel, projects involving, new buildings, existing units, Performed advanced, advanced troubleshooting, production equipment, hydraulic presses, composite molding, industrial automation, production equipment, HMI programming, primarily Allen, Bradley SLC500, SLC500 platform, Maintenance Manager, Environmental Manager, State Tyco, Tyco purchased, plant maintenance, engineering personnel, applicable federal, local laws, required permits, local authorities, applied understanding, plant engineering, engineering including, Electrical systems, Circuit planning, Power distribution, Electrical machinery, Mechanical Systems, Pumps piping, compressed air, air systems, Power transmission, Material handling, Fire protection, Structural design, life safety, safety codes, Systems reliability, Understanding drawings, Maintenance programs, predictive maintenance, maintenance practices, Maintenance parts, supplies inventory, inventory management, Manpower planning, Personnel development, Labor relations, Project administration, Record keeping, Health management, Noise control, Air quality, quality control, Water quality, quality control, Solid waste, waste handling, Hazardous materials, materials controls, Regulations codes, new material, material handling, handling control, control system, Created custom, custom database, accounting programs, Microsoft Access, Performed advanced, advanced troubleshooting, plant equipment, Converted antiquated, antiquated Modicon, Modicon PLC, PLC control, control system, Bradley PLC, Wonderware man, man machine, machine interface(HMI, Trained plant, plant maintenance, maintenance personnel, PLC programming, DC drive, drive troubleshooting, advanced electrical, electrical controls, controls troubleshooting, Maintenance Technician, State Performed, Performed routine, routine electrical, mechanical maintenance, emergency repairs, automated PLC, PLC controlled, controlled conveyors, pallet wrappers, Apple computers, Completed PLC, PLC logic, logic changes, written instruction, maintained logic, logic backups, revision history, State Responsible, maintaining plastic, plastic extrusion, extrusion equipment, plastic bags, stretch pallet, pallet wrap, Performed process, process troubleshooting, entire production, production lines, including programmable, programmable logic, logic controllers, AC inverters, DC drives, DC motors, associated control, control equipment, plant utilities, utilities including, including chillers, air compressors, power distribution, Completed electrical, electrical installations, verbal instructions, Computerized Maintenance, Maintenance Management, Management System(CMMS, efficient tracking, maintenance resources, Helped set, successful predictive, preventive maintenance, maintenance program, greatly reduced, reduced cost, emergency repairs, DC drives, P.L.C. programming, Microwave Communications, Communications Technician, State Worked, rebuild facility, wide variety, communications equipment, Primary job, rebuild microwave, microwave communications, communications equipment, repaired UHF, VHF radios, computerized inventory, inventory control, control program, greatly reduced, hours required, perform quarterly, quarterly inventories, HACCP Online, Online Course, Food Safety, Yuba Community, Community College, Business Management, State Coursework, Business Management, NEEC Building, Building Operator, Operator Certification, Butte College, Basic Electronics, High School, School Diploma, Elk Creek, Creek High, High School, State Select, Better Process, Process Control, Control School, NEEC Building, Building Operator, Operator Skills, Skills accounting, Apple computers, asset management, Electrical systems, equipment installation, Fire protection, Food safety, inventory management, inventory control, Labor relations, maintenance schedules, manufacturing processes, Microsoft Access, Microsoft NT, NT server, Microsoft Windows, Windows NT, NT Server, PLC programming, Power distribution, process control, process engineering, quality control, Record keeping, safety codes, Siemens PLC, technical support, Water quality]",
    "clean_data": "ENGINEERING SERVICES MANAGER Executive Profile A results driven Controls Engineer and Project Manager with over 20 years of experience in manufacturing. Skilled in Industrial Automation and Process Engineering with a strong mechanical design background. Proven ability to lead and motivate high performance teams. History of building systems with improved functionality and productivity, consistently meeting critical requirements. Skill Highlights Proficient in process engineering and applying process needs to available technology to improve production availability and uptime. Proficient in process engineering and applying process needs to available technology to improve production runablility and uptime. Professional Experience Engineering Services Manager   02/2013   ï¼  08/2015   Company Name   City   ,  State Accountable for maintaining the efficiency and effectiveness of all production manufacturing processes required to manufacture a high quality product in a repeatable and cost effective manner and provide overall customer satisfaction. Manage  all engineering services with provision of all energy sources. Accountable for all mechanical repairs, design and construction within all departments and the resources engaged in the provision of these services both internal and external. Support waste water operations by providing advanced troubleshooting on Siemens PLC's. Configured WINCC SCADA system. Ensure that all expenditures both in supplies and staffing are optimized and maintained within budget. Developed asset management software to track cost, asset history and work order tracking. Performed advanced troubleshooting and PLC support for all plant equipment. Electrical Superintendent   05/2008   ï¼  02/2013   Company Name   City   ,  State Primary responsibilities include supervising and coordinating all electrical and instrumentation activities. Accountable for the proper operation of all automation and controls on production equipment, power distribution systems, plant communications (phones, networks) and security systems. Managed projects for installation of new equipment, from design concept to installation and start up. Managed large network of Allen-Bradley PLC's, including ControLogix, CompactLogix and micro controllers with FactoryTalk View ME and SE human machine interfaces. Managed the installation and startup of several new projects over $1MM: HG Molenaar cooker/cooler, Buscetto steam peeler, Navatta steam peeler, Zilli-Bellini diced tomato filling line. Perform advanced troubleshooting and PLC support for all plant equipment. Trained electricians and instrument technicians in advanced VFD troubleshooting and configuration, PLC programming, process control and applicable regulations including NFPA 70E and NEC codes. Project Manager   05/2005   ï¼  05/2008   Company Name   City   ,  State Responsible to review and interpret proposed designs, drawings, and specifications for suitability and initiate revisions where appropriate. Managed a team of 5 engineers in the design of various machine sections to ensure on-time project completion. Supervised the mechanical and electrical assembly of equipment to ensure that sections are completed on time and meet customer specs. Managed cross-functional teams to insure on time installation of equipment at customers facilities. Coordinated with vendors and other contractors to complete equipment installation. Developed and administered project budgets and fiscal controls, contracts, and quality control provisions for projects. Facility Supervisor   04/2004   ï¼  05/2005   Company Name   City   ,  State Managed the activities of 6 maintenance personnel. Accountable for projects involving the construction of new buildings and facilities, also the alteration or modification of existing units. Performed advanced troubleshooting and repairs on production equipment, such as hydraulic presses, autoclaves and other equipment used in composite molding. Design, layout and installation of industrial automation used in production equipment. PLC and HMI programming, primarily Allen-Bradley SLC500 platform. Maintenance Manager/Safety & Environmental Manager   01/1996   ï¼  04/2004   Company Name   City   ,  State Tyco purchased the facility in 2001. Managed the operations and activities of plant maintenance and engineering personnel. Accountable for compliance with applicable federal, state and local laws and regulations, securing all required permits, and coordinating with local authorities. Maintain a proficiency and applied understanding of all aspects of plant engineering including: Electrical systems - Circuit planning, Power distribution, Illumination, Instrumentation and controls, Electrical machinery, Codes and standards. Mechanical Systems - HVAC, Pumps piping and plumbing, Compressors and compressed air systems, Power transmission, Material handling and storage, Fire protection, Structural design and analysis, Building and life safety codes. Maintenance - Systems reliability, Understanding drawings and specifications, Maintenance programs and management, Preventive and predictive maintenance practices, Maintenance parts and supplies inventory management, Building and grounds, Housekeeping. Administration and Supervision - Manpower planning, Personnel development, Labor relations, Project administration and management, Record keeping. Environmental, Safety and Health management - Noise control, Air quality control, Water quality control, Solid waste handling, Hazardous materials controls, Regulations codes and standards. Responsible for the installation, programming, maintenance and operation of new material handling control system. Created custom database and production/accounting programs with Microsoft Access. Performed advanced troubleshooting on all plant equipment. Converted antiquated Modicon PLC control system to Allen-Bradley PLC with Wonderware man machine interface(HMI). Trained plant maintenance personnel on PLC programming, AC/DC drive troubleshooting and advanced electrical controls troubleshooting. Maintenance Technician   04/1995   ï¼  12/1995   Company Name   City   ,  State Performed routine electrical and mechanical maintenance and emergency repairs on automated PLC controlled conveyors, pallet wrappers, burn-in towers and other equipment used in the assembly of Apple computers. Completed PLC logic changes from verbal or written instruction and maintained logic backups with revision history. Electrician   08/1991   ï¼  04/1995   Company Name   City   ,  State Responsible for repairing and maintaining plastic extrusion equipment in the production of plastic bags and stretch pallet wrap. Performed process troubleshooting of entire production lines, including programmable logic controllers (PLC's), AC inverters and DC drives, AC and DC motors and all associated control equipment. Maintained all aspects of plant utilities including chillers, air compressors and power distribution. Completed electrical installations from blueprints, sketches or verbal instructions with little or no supervision. Designed and implemented a Computerized Maintenance Management System(CMMS) that allowed for more efficient tracking of maintenance resources and cost. Helped set up and run a successful predictive/preventive maintenance program that greatly reduced cost of emergency repairs. Instructed other electricians in maintenance and troubleshooting of AC and DC drives and P.L.C. programming. Microwave Communications Technician   02/1987   ï¼  04/1991   Company Name   City   ,  State Worked for a rebuild facility doing repairs and overhauls of a wide variety of communications equipment. Primary job was to rebuild microwave communications equipment. Also repaired UHF and VHF radios. Created a computerized inventory control program that greatly reduced the amount of man-hours required to perform quarterly inventories. Education 2015   Certificate of Completion   :   AIB - HACCP Online Course   -  Haccp/Food Safety 2004   Select One   :   Yuba Community College   -  Business Management   City   ,  State Coursework in Business Management 2003   NEEC Building Operator Certification   :   Butte College   -  Basic Electronics, Drafting   City   ,  State 1985   High School Diploma   :   Elk Creek High School   City   ,  State Select One   :   Better Process Control School   City   ,  State   ,  USA   Level 1   :   NEEC Building Operator Skills accounting, Apple computers, asset management, automation, basic, blueprints, budgets, budget, C, CA, hardware, concept, contracts, client, database, DC, delivery, design and construction, directing, Electrical systems, electronics, equipment installation, filling, Fire protection, Food safety, Hammer, HVAC, instruction, inventory management, inventory control, Labor relations, layout, logic, Logistics, machinery, maintenance schedules, manufacturing processes, materials, Mechanical, Microsoft Access, 2000, Microsoft NT server, Microsoft Windows NT Server, microwave, NEC, network, networks, Novell, Personnel, PLC programming, PLC, plumbing, Power distribution, process control, process engineering, Programming, quality, quality control, radio, Record keeping, repairs, repairing, Safety, safety codes, SCADA, Siemens PLC, staffing, supervising, Supervision, surveys, technical support, phones, transmission, troubleshooting, UHF, utilities, validation, VHF, View, Water quality, Wonderware, written",
    "emails": [],
    "entities": [
        "State Tyco",
        "State Performed",
        "Basic Electronics",
        "Computerized Maintenance Management",
        "Microsoft",
        "Wonderware",
        "NEC",
        "Supervision - Manpower",
        "ControLogix",
        "PLC",
        "AC/DC",
        "Better Process Control School",
        "State Coursework in Business Management 2003",
        "Hazardous",
        "Apple",
        "Safety and Health",
        "State Primary",
        "Novell",
        "Yuba Community College",
        "Navatta",
        "Personnel",
        "Safety",
        "VHF",
        "Elk Creek High School",
        "Siemens PLC",
        "Microsoft Windows NT Server",
        "Logistics",
        "Microsoft Access",
        "Siemens PLC's",
        "Butte College",
        "CompactLogix",
        "Mechanical",
        "AC",
        "SCADA",
        "Allen-Bradley PLC",
        "Haccp/Food Safety 2004",
        "Industrial Automation and Process Engineering",
        "Housekeeping.",
        "Labor",
        "Modicon PLC",
        "Mechanical Systems - HVAC",
        "Safety & Environmental",
        "State",
        "CA",
        "State Responsible",
        "UHF",
        "Zilli-Bellini",
        "Maintenance - Systems",
        "Allen-Bradley PLC's",
        "Completed PLC",
        "NFPA 70E",
        "Business Management   City",
        "Professional Experience Engineering Services"
    ],
    "experience": "Experience Engineering Services Manager    02/2013    ï¼   08/2015    Company Name    City    ,   State Accountable for maintaining the efficiency and effectiveness of all production manufacturing processes required to manufacture a high quality product in a repeatable and cost effective manner and provide overall customer satisfaction . Manage   all engineering services with provision of all energy sources . Accountable for all mechanical repairs , design and construction within all departments and the resources engaged in the provision of these services both internal and external . Support waste water operations by providing advanced troubleshooting on Siemens PLC 's . Configured WINCC SCADA system . Ensure that all expenditures both in supplies and staffing are optimized and maintained within budget . Developed asset management software to track cost , asset history and work order tracking . Performed advanced troubleshooting and PLC support for all plant equipment . Electrical Superintendent    05/2008    ï¼   02/2013    Company Name    City    ,   State Primary responsibilities include supervising and coordinating all electrical and instrumentation activities . Accountable for the proper operation of all automation and controls on production equipment , power distribution systems , plant communications ( phones , networks ) and security systems . Managed projects for installation of new equipment , from design concept to installation and start up . Managed large network of Allen - Bradley PLC 's , including ControLogix , CompactLogix and micro controllers with FactoryTalk View ME and SE human machine interfaces . Managed the installation and startup of several new projects over $ 1MM : HG Molenaar cooker / cooler , Buscetto steam peeler , Navatta steam peeler , Zilli - Bellini diced tomato filling line . Perform advanced troubleshooting and PLC support for all plant equipment . Trained electricians and instrument technicians in advanced VFD troubleshooting and configuration , PLC programming , process control and applicable regulations including NFPA 70E and NEC codes . Project Manager    05/2005    ï¼   05/2008    Company Name    City    ,   State Responsible to review and interpret proposed designs , drawings , and specifications for suitability and initiate revisions where appropriate . Managed a team of 5 engineers in the design of various machine sections to ensure on - time project completion . Supervised the mechanical and electrical assembly of equipment to ensure that sections are completed on time and meet customer specs . Managed cross - functional teams to insure on time installation of equipment at customers facilities . Coordinated with vendors and other contractors to complete equipment installation . Developed and administered project budgets and fiscal controls , contracts , and quality control provisions for projects . Facility Supervisor    04/2004    ï¼   05/2005    Company Name    City    ,   State Managed the activities of 6 maintenance personnel . Accountable for projects involving the construction of new buildings and facilities , also the alteration or modification of existing units . Performed advanced troubleshooting and repairs on production equipment , such as hydraulic presses , autoclaves and other equipment used in composite molding . Design , layout and installation of industrial automation used in production equipment . PLC and HMI programming , primarily Allen - Bradley SLC500 platform . Maintenance Manager / Safety & Environmental Manager    01/1996    ï¼   04/2004    Company Name    City    ,   State Tyco purchased the facility in 2001 . Managed the operations and activities of plant maintenance and engineering personnel . Accountable for compliance with applicable federal , state and local laws and regulations , securing all required permits , and coordinating with local authorities . Maintain a proficiency and applied understanding of all aspects of plant engineering including : Electrical systems - Circuit planning , Power distribution , Illumination , Instrumentation and controls , Electrical machinery , Codes and standards . Mechanical Systems - HVAC , Pumps piping and plumbing , Compressors and compressed air systems , Power transmission , Material handling and storage , Fire protection , Structural design and analysis , Building and life safety codes . Maintenance - Systems reliability , Understanding drawings and specifications , Maintenance programs and management , Preventive and predictive maintenance practices , Maintenance parts and supplies inventory management , Building and grounds , Housekeeping . Administration and Supervision - Manpower planning , Personnel development , Labor relations , Project administration and management , Record keeping . Environmental , Safety and Health management - Noise control , Air quality control , Water quality control , Solid waste handling , Hazardous materials controls , Regulations codes and standards . Responsible for the installation , programming , maintenance and operation of new material handling control system . Created custom database and production / accounting programs with Microsoft Access . Performed advanced troubleshooting on all plant equipment . Converted antiquated Modicon PLC control system to Allen - Bradley PLC with Wonderware man machine interface(HMI ) . Trained plant maintenance personnel on PLC programming , AC / DC drive troubleshooting and advanced electrical controls troubleshooting . Maintenance Technician    04/1995    ï¼   12/1995    Company Name    City    ,   State Performed routine electrical and mechanical maintenance and emergency repairs on automated PLC controlled conveyors , pallet wrappers , burn - in towers and other equipment used in the assembly of Apple computers . Completed PLC logic changes from verbal or written instruction and maintained logic backups with revision history . Electrician    08/1991    ï¼   04/1995    Company Name    City    ,   State Responsible for repairing and maintaining plastic extrusion equipment in the production of plastic bags and stretch pallet wrap . Performed process troubleshooting of entire production lines , including programmable logic controllers ( PLC 's ) , AC inverters and DC drives , AC and DC motors and all associated control equipment . Maintained all aspects of plant utilities including chillers , air compressors and power distribution . Completed electrical installations from blueprints , sketches or verbal instructions with little or no supervision . Designed and implemented a Computerized Maintenance Management System(CMMS ) that allowed for more efficient tracking of maintenance resources and cost . Helped set up and run a successful predictive / preventive maintenance program that greatly reduced cost of emergency repairs . Instructed other electricians in maintenance and troubleshooting of AC and DC drives and P.L.C. programming . Microwave Communications Technician    02/1987    ï¼   04/1991    Company Name    City    ,   State Worked for a rebuild facility doing repairs and overhauls of a wide variety of communications equipment . Primary job was to rebuild microwave communications equipment . Also repaired UHF and VHF radios . Created a computerized inventory control program that greatly reduced the amount of man - hours required to perform quarterly inventories . Education 2015    Certificate of Completion    :    AIB - HACCP Online Course    -   Haccp / Food Safety 2004    Select One    :    Yuba Community College    -   Business Management    City    ,   State Coursework in Business Management 2003    NEEC Building Operator Certification    :    Butte College    -   Basic Electronics , Drafting    City    ,   State 1985    High School Diploma    :    Elk Creek High School    City    ,   State Select One    :    Better Process Control School    City    ,   State    ,   USA    Level 1    :    NEEC Building Operator Skills accounting , Apple computers , asset management , automation , basic , blueprints , budgets , budget , C , CA , hardware , concept , contracts , client , database , DC , delivery , design and construction , directing , Electrical systems , electronics , equipment installation , filling , Fire protection , Food safety , Hammer , HVAC , instruction , inventory management , inventory control , Labor relations , layout , logic , Logistics , machinery , maintenance schedules , manufacturing processes , materials , Mechanical , Microsoft Access , 2000 , Microsoft NT server , Microsoft Windows NT Server , microwave , NEC , network , networks , Novell , Personnel , PLC programming , PLC , plumbing , Power distribution , process control , process engineering , Programming , quality , quality control , radio , Record keeping , repairs , repairing , Safety , safety codes , SCADA , Siemens PLC , staffing , supervising , Supervision , surveys , technical support , phones , transmission , troubleshooting , UHF , utilities , validation , VHF , View , Water quality , Wonderware , written",
    "extracted_keywords": [
        "ENGINEERING",
        "SERVICES",
        "MANAGER",
        "Executive",
        "Profile",
        "results",
        "Controls",
        "Engineer",
        "Project",
        "Manager",
        "years",
        "experience",
        "manufacturing",
        "Industrial",
        "Automation",
        "Process",
        "Engineering",
        "design",
        "background",
        "ability",
        "performance",
        "teams",
        "History",
        "building",
        "systems",
        "functionality",
        "productivity",
        "requirements",
        "Skill",
        "Highlights",
        "Proficient",
        "process",
        "engineering",
        "process",
        "technology",
        "production",
        "availability",
        "uptime",
        "process",
        "engineering",
        "process",
        "technology",
        "production",
        "runablility",
        "uptime",
        "Professional",
        "Experience",
        "Engineering",
        "Services",
        "Manager",
        "02/2013",
        "ï¼",
        "08/2015",
        "Company",
        "Name",
        "City",
        "State",
        "Accountable",
        "efficiency",
        "effectiveness",
        "production",
        "manufacturing",
        "processes",
        "quality",
        "product",
        "manner",
        "customer",
        "satisfaction",
        "engineering",
        "services",
        "provision",
        "energy",
        "sources",
        "repairs",
        "design",
        "construction",
        "departments",
        "resources",
        "provision",
        "services",
        "waste",
        "water",
        "operations",
        "troubleshooting",
        "Siemens",
        "PLC",
        "WINCC",
        "SCADA",
        "system",
        "expenditures",
        "supplies",
        "staffing",
        "budget",
        "asset",
        "management",
        "software",
        "cost",
        "asset",
        "history",
        "work",
        "order",
        "tracking",
        "troubleshooting",
        "PLC",
        "support",
        "plant",
        "equipment",
        "Superintendent",
        "05/2008",
        "ï¼",
        "02/2013",
        "Company",
        "Name",
        "City",
        "State",
        "Primary",
        "responsibilities",
        "instrumentation",
        "activities",
        "operation",
        "automation",
        "controls",
        "production",
        "equipment",
        "power",
        "distribution",
        "systems",
        "plant",
        "communications",
        "phones",
        "networks",
        "security",
        "systems",
        "projects",
        "installation",
        "equipment",
        "design",
        "concept",
        "installation",
        "network",
        "Allen",
        "Bradley",
        "PLC",
        "ControLogix",
        "CompactLogix",
        "micro",
        "controllers",
        "FactoryTalk",
        "ME",
        "SE",
        "machine",
        "interfaces",
        "installation",
        "startup",
        "projects",
        "HG",
        "Molenaar",
        "cooker",
        "Buscetto",
        "steam",
        "peeler",
        "Navatta",
        "steam",
        "peeler",
        "Zilli",
        "Bellini",
        "tomato",
        "filling",
        "line",
        "troubleshooting",
        "PLC",
        "support",
        "plant",
        "equipment",
        "electricians",
        "technicians",
        "VFD",
        "troubleshooting",
        "configuration",
        "PLC",
        "programming",
        "process",
        "control",
        "regulations",
        "NFPA",
        "70E",
        "NEC",
        "codes",
        "Project",
        "Manager",
        "ï¼",
        "05/2008",
        "Company",
        "Name",
        "City",
        "State",
        "Responsible",
        "designs",
        "drawings",
        "specifications",
        "suitability",
        "revisions",
        "team",
        "engineers",
        "design",
        "machine",
        "sections",
        "time",
        "project",
        "completion",
        "assembly",
        "equipment",
        "sections",
        "time",
        "customer",
        "specs",
        "teams",
        "time",
        "installation",
        "equipment",
        "customers",
        "facilities",
        "vendors",
        "contractors",
        "equipment",
        "installation",
        "project",
        "budgets",
        "controls",
        "contracts",
        "quality",
        "control",
        "provisions",
        "projects",
        "Facility",
        "Supervisor",
        "04/2004",
        "ï¼",
        "Company",
        "Name",
        "City",
        "State",
        "activities",
        "maintenance",
        "personnel",
        "projects",
        "construction",
        "buildings",
        "facilities",
        "alteration",
        "modification",
        "units",
        "troubleshooting",
        "repairs",
        "production",
        "equipment",
        "presses",
        "autoclaves",
        "equipment",
        "molding",
        "Design",
        "layout",
        "installation",
        "automation",
        "production",
        "equipment",
        "PLC",
        "HMI",
        "programming",
        "Allen",
        "Bradley",
        "SLC500",
        "platform",
        "Maintenance",
        "Manager",
        "Safety",
        "Environmental",
        "Manager",
        "ï¼",
        "04/2004",
        "Company",
        "Name",
        "City",
        "State",
        "Tyco",
        "facility",
        "operations",
        "activities",
        "plant",
        "maintenance",
        "engineering",
        "personnel",
        "compliance",
        "state",
        "laws",
        "regulations",
        "permits",
        "authorities",
        "proficiency",
        "understanding",
        "aspects",
        "plant",
        "engineering",
        "systems",
        "Circuit",
        "planning",
        "Power",
        "distribution",
        "Illumination",
        "Instrumentation",
        "controls",
        "machinery",
        "Codes",
        "standards",
        "Mechanical",
        "Systems",
        "HVAC",
        "Pumps",
        "piping",
        "plumbing",
        "Compressors",
        "air",
        "systems",
        "Power",
        "transmission",
        "Material",
        "handling",
        "storage",
        "Fire",
        "protection",
        "design",
        "analysis",
        "Building",
        "life",
        "safety",
        "codes",
        "Maintenance",
        "Systems",
        "reliability",
        "drawings",
        "specifications",
        "Maintenance",
        "programs",
        "management",
        "maintenance",
        "practices",
        "Maintenance",
        "parts",
        "inventory",
        "management",
        "Building",
        "grounds",
        "Housekeeping",
        "Administration",
        "Supervision",
        "Manpower",
        "planning",
        "Personnel",
        "development",
        "Labor",
        "relations",
        "Project",
        "administration",
        "management",
        "Record",
        "keeping",
        "Safety",
        "Health",
        "management",
        "Noise",
        "control",
        "Air",
        "quality",
        "control",
        "Water",
        "quality",
        "control",
        "waste",
        "handling",
        "materials",
        "controls",
        "Regulations",
        "codes",
        "standards",
        "installation",
        "programming",
        "maintenance",
        "operation",
        "material",
        "handling",
        "control",
        "system",
        "custom",
        "database",
        "production",
        "accounting",
        "programs",
        "Microsoft",
        "Access",
        "troubleshooting",
        "plant",
        "equipment",
        "Modicon",
        "PLC",
        "control",
        "system",
        "Allen",
        "Bradley",
        "PLC",
        "Wonderware",
        "man",
        "machine",
        "interface(HMI",
        "plant",
        "maintenance",
        "personnel",
        "PLC",
        "programming",
        "AC",
        "DC",
        "drive",
        "troubleshooting",
        "controls",
        "troubleshooting",
        "Maintenance",
        "Technician",
        "04/1995",
        "ï¼",
        "12/1995",
        "Company",
        "Name",
        "City",
        "State",
        "maintenance",
        "emergency",
        "repairs",
        "PLC",
        "conveyors",
        "pallet",
        "wrappers",
        "towers",
        "equipment",
        "assembly",
        "Apple",
        "computers",
        "Completed",
        "PLC",
        "logic",
        "changes",
        "instruction",
        "logic",
        "backups",
        "revision",
        "history",
        "Electrician",
        "ï¼",
        "04/1995",
        "Company",
        "Name",
        "City",
        "State",
        "Responsible",
        "extrusion",
        "equipment",
        "production",
        "bags",
        "wrap",
        "process",
        "troubleshooting",
        "production",
        "lines",
        "logic",
        "controllers",
        "PLC",
        "AC",
        "inverters",
        "DC",
        "drives",
        "AC",
        "DC",
        "motors",
        "control",
        "equipment",
        "aspects",
        "plant",
        "utilities",
        "chillers",
        "air",
        "compressors",
        "power",
        "distribution",
        "installations",
        "blueprints",
        "sketches",
        "instructions",
        "supervision",
        "Computerized",
        "Maintenance",
        "Management",
        "System(CMMS",
        "tracking",
        "maintenance",
        "resources",
        "cost",
        "maintenance",
        "program",
        "cost",
        "emergency",
        "repairs",
        "electricians",
        "maintenance",
        "troubleshooting",
        "AC",
        "DC",
        "drives",
        "P.L.C.",
        "programming",
        "Microwave",
        "Communications",
        "Technician",
        "ï¼",
        "04/1991",
        "Company",
        "Name",
        "City",
        "State",
        "Worked",
        "rebuild",
        "facility",
        "repairs",
        "overhauls",
        "variety",
        "communications",
        "equipment",
        "job",
        "microwave",
        "communications",
        "equipment",
        "UHF",
        "VHF",
        "radios",
        "inventory",
        "control",
        "program",
        "amount",
        "man",
        "hours",
        "inventories",
        "Education",
        "Certificate",
        "Completion",
        "AIB",
        "HACCP",
        "Online",
        "Course",
        "Haccp",
        "Food",
        "Safety",
        "Select",
        "Yuba",
        "Community",
        "College",
        "Business",
        "Management",
        "City",
        "State",
        "Coursework",
        "Business",
        "Management",
        "NEEC",
        "Building",
        "Operator",
        "Certification",
        "Butte",
        "College",
        "Basic",
        "Electronics",
        "Drafting",
        "City",
        "State",
        "High",
        "School",
        "Diploma",
        "Elk",
        "Creek",
        "High",
        "School",
        "City",
        "State",
        "Select",
        "Better",
        "Process",
        "Control",
        "School",
        "City",
        "State",
        "USA",
        "Level",
        "NEEC",
        "Building",
        "Operator",
        "Skills",
        "accounting",
        "Apple",
        "computers",
        "asset",
        "management",
        "automation",
        "blueprints",
        "budgets",
        "budget",
        "C",
        "CA",
        "hardware",
        "concept",
        "contracts",
        "client",
        "database",
        "DC",
        "delivery",
        "design",
        "construction",
        "systems",
        "electronics",
        "equipment",
        "installation",
        "Fire",
        "protection",
        "Food",
        "safety",
        "Hammer",
        "HVAC",
        "instruction",
        "inventory",
        "management",
        "inventory",
        "control",
        "Labor",
        "relations",
        "layout",
        "logic",
        "Logistics",
        "machinery",
        "maintenance",
        "schedules",
        "manufacturing",
        "processes",
        "materials",
        "Mechanical",
        "Microsoft",
        "Access",
        "Microsoft",
        "NT",
        "server",
        "Microsoft",
        "Windows",
        "NT",
        "Server",
        "microwave",
        "NEC",
        "network",
        "networks",
        "Novell",
        "Personnel",
        "PLC",
        "programming",
        "PLC",
        "plumbing",
        "Power",
        "distribution",
        "process",
        "control",
        "process",
        "engineering",
        "Programming",
        "quality",
        "quality",
        "control",
        "radio",
        "Record",
        "keeping",
        "repairs",
        "Safety",
        "safety",
        "codes",
        "SCADA",
        "Siemens",
        "PLC",
        "staffing",
        "Supervision",
        "surveys",
        "support",
        "phones",
        "transmission",
        "troubleshooting",
        "UHF",
        "utilities",
        "validation",
        "VHF",
        "View",
        "Water",
        "quality",
        "Wonderware"
    ],
    "keyterms": [
        [
            "advanced troubleshooting",
            0.09350690864351346
        ],
        [
            "production equipment",
            0.05696809292337071
        ],
        [
            "plant equipment",
            0.056457941364368394
        ],
        [
            "power distribution",
            0.03828527177012967
        ],
        [
            "quality control",
            0.03246052345719595
        ],
        [
            "PLC programming",
            0.03172081768676087
        ],
        [
            "design",
            0.026346885435406118
        ],
        [
            "system",
            0.025437243589258036
        ],
        [
            "Manager",
            0.024017434656799137
        ],
        [
            "City",
            0.020757278371468214
        ],
        [
            "process",
            0.01943112343869092
        ],
        [
            "ï¼",
            0.018308120395065006
        ],
        [
            "State",
            0.016708788702285225
        ],
        [
            "mechanical",
            0.014712392154647414
        ],
        [
            "DC drive",
            0.013672523860816892
        ],
        [
            "electrical",
            0.013324053115258017
        ],
        [
            "Project",
            0.013281353887588174
        ],
        [
            "installation",
            0.012903229180753767
        ],
        [
            "building",
            0.012592199948056331
        ],
        [
            "accountable",
            0.01037535239234535
        ]
    ],
    "phones": [],
    "resume_data": "ENGINEERING SERVICES MANAGER\nExecutive Profile\nA results driven Controls Engineer and Project Manager with over 20 years of experience in manufacturing. Skilled in Industrial Automation and\nProcess Engineering with a strong mechanical design background. Proven ability to lead and motivate high performance teams. History of building\nsystems with improved functionality and productivity, consistently meeting critical requirements.\nSkill Highlights\nProficient in process engineering and applying process needs to\navailable technology to improve production availability and\nuptime.\nProficient in process engineering and applying process needs to\navailable technology to improve production runablility and uptime.\nProfessional Experience\nEngineering Services Manager\n \n02/2013\n \nï¼​ \n08/2015\n \nCompany Name\n \nCity\n \n, \nState\nAccountable for maintaining the efficiency and effectiveness of all production manufacturing processes required to manufacture a high quality\nproduct in a repeatable and cost effective manner and provide overall customer satisfaction.\nManage \nall engineering services with provision of all energy sources. Accountable for all mechanical repairs, design and construction within\nall departments and the resources engaged in the provision of these services both internal and external.\nSupport waste water operations by providing advanced troubleshooting on Siemens PLC's. Configured WINCC SCADA system.\nEnsure that all expenditures both in supplies and staffing are optimized and maintained within budget.\nDeveloped asset management software to track cost, asset history and work order tracking.\nPerformed advanced troubleshooting and PLC support for all plant equipment.\nElectrical Superintendent\n \n05/2008\n \nï¼​ \n02/2013\n \nCompany Name\n \nCity\n \n, \nState\nPrimary responsibilities include supervising and coordinating all electrical and instrumentation activities.\nAccountable for the proper operation of all automation and controls on production equipment, power distribution systems, plant\ncommunications (phones, networks) and security systems.\nManaged projects for installation of new equipment, from design concept to installation and start up.\nManaged large network of Allen-Bradley PLC's, including ControLogix, CompactLogix and micro controllers with FactoryTalk View ME\nand SE human machine interfaces.\nManaged the installation and startup of several new projects over $1MM: HG Molenaar cooker/cooler, Buscetto steam peeler, Navatta\nsteam peeler, Zilli-Bellini diced tomato filling line.\nPerform advanced troubleshooting and PLC support for all plant equipment.\nTrained electricians and instrument technicians in advanced VFD troubleshooting and configuration, PLC programming, process control and\napplicable regulations including NFPA 70E and NEC codes.\nProject Manager\n \n05/2005\n \nï¼​ \n05/2008\n \nCompany Name\n \nCity\n \n, \nState\nResponsible to review and interpret proposed designs, drawings, and specifications for suitability and initiate revisions where appropriate.\nManaged a team of 5 engineers in the design of various machine sections to ensure on-time project completion.\nSupervised the mechanical and electrical assembly of equipment to ensure that sections are completed on time and meet customer specs.\nManaged cross-functional teams to insure on time installation of equipment at customers facilities.\nCoordinated with vendors and other contractors to complete equipment installation.\nDeveloped and administered project budgets and fiscal controls, contracts, and quality control provisions for projects.\nFacility Supervisor\n \n04/2004\n \nï¼​ \n05/2005\n \nCompany Name\n \nCity\n \n, \nState\nManaged the activities of 6 maintenance personnel.\nAccountable for projects involving the construction of new buildings and facilities, also the alteration or modification of existing units.\nPerformed advanced troubleshooting and repairs on production equipment, such as hydraulic presses, autoclaves and other equipment used\nin composite molding.\nDesign, layout and installation of industrial automation used in production equipment.\nPLC and HMI programming, primarily Allen-Bradley SLC500 platform.\nMaintenance Manager/Safety & Environmental Manager\n \n01/1996\n \nï¼​ \n04/2004\n \nCompany Name\n \nCity\n \n, \nState\nTyco purchased the facility in 2001.\nManaged the operations and activities of plant maintenance and engineering personnel.\nAccountable for compliance with applicable federal, state and local laws and regulations, securing all required permits, and coordinating with\nlocal authorities.\nMaintain a proficiency and applied understanding of all aspects of plant engineering including: Electrical systems - Circuit planning, Power\ndistribution, Illumination, Instrumentation and controls, Electrical machinery, Codes and standards.\nMechanical Systems - HVAC, Pumps piping and plumbing, Compressors and compressed air systems, Power transmission, Material\nhandling and storage, Fire protection, Structural design and analysis, Building and life safety codes.\nMaintenance - Systems reliability, Understanding drawings and specifications, Maintenance programs and management, Preventive and\npredictive maintenance practices, Maintenance parts and supplies inventory management, Building and grounds, Housekeeping. Administration and Supervision - Manpower planning, Personnel development, Labor relations, Project administration and management,\nRecord keeping.\nEnvironmental, Safety and Health management - Noise control, Air quality control, Water quality control, Solid waste handling, Hazardous\nmaterials controls, Regulations codes and standards.\nResponsible for the installation, programming, maintenance and operation of new material handling control system.\nCreated custom database and production/accounting programs with Microsoft Access.\nPerformed advanced troubleshooting on all plant equipment.\nConverted antiquated Modicon PLC control system to Allen-Bradley PLC with Wonderware man machine interface(HMI).\nTrained plant maintenance personnel on PLC programming, AC/DC drive troubleshooting and advanced electrical controls troubleshooting.\nMaintenance Technician\n \n04/1995\n \nï¼​ \n12/1995\n \nCompany Name\n \nCity\n \n, \nState\nPerformed routine electrical and mechanical maintenance and emergency repairs on automated PLC controlled conveyors, pallet wrappers,\nburn-in towers and other equipment used in the assembly of Apple computers.\nCompleted PLC logic changes from verbal or written instruction and maintained logic backups with revision history.\nElectrician\n \n08/1991\n \nï¼​ \n04/1995\n \nCompany Name\n \nCity\n \n, \nState\nResponsible for repairing and maintaining plastic extrusion equipment in the production of plastic bags and stretch pallet wrap.\nPerformed process troubleshooting of entire production lines, including programmable logic controllers (PLC's), AC inverters and DC\ndrives, AC and DC motors and all associated control equipment.\nMaintained all aspects of plant utilities including chillers, air compressors and power distribution.\nCompleted electrical installations from blueprints, sketches or verbal instructions with little or no supervision.\nDesigned and implemented a Computerized Maintenance Management System(CMMS) that allowed for more efficient tracking of\nmaintenance resources and cost.\nHelped set up and run a successful predictive/preventive maintenance program that greatly reduced cost of emergency repairs.\nInstructed other electricians in maintenance and troubleshooting of AC and DC drives and P.L.C.\nprogramming.\nMicrowave Communications Technician\n \n02/1987\n \nï¼​ \n04/1991\n \nCompany Name\n \nCity\n \n, \nState\nWorked for a rebuild facility doing repairs and overhauls of a wide variety of communications equipment. Primary job was to rebuild\nmicrowave communications equipment. Also repaired UHF and VHF radios.\nCreated a computerized inventory control program that greatly reduced the amount of man-hours required to perform quarterly inventories.\nEducation\n2015\n \nCertificate of Completion\n \n:\n \nAIB - HACCP Online Course\n \n- \nHaccp/Food Safety\n2004\n \nSelect One\n \n:\n \nYuba Community College\n \n- \nBusiness Management\n \nCity\n \n, \nState\nCoursework in Business Management\n2003\n \nNEEC Building Operator Certification\n \n:\n \nButte College\n \n- \nBasic Electronics, Drafting\n \nCity\n \n, \nState\n1985\n \nHigh School Diploma\n \n:\n \nElk Creek High School\n \nCity\n \n, \nState\nSelect One\n \n:\n \nBetter Process Control School\n \nCity\n \n, \nState\n \n, \nUSA\n \nLevel 1\n \n:\n \nNEEC Building Operator\nSkills\naccounting, Apple computers, asset management, automation, basic, blueprints, budgets, budget, C, CA, hardware, concept, contracts, client,\ndatabase, DC, delivery, design and construction, directing, Electrical systems, electronics, equipment installation, filling, Fire protection, Food\nsafety, Hammer, HVAC, instruction, inventory management, inventory control, Labor relations, layout, logic, Logistics, machinery, maintenance\nschedules, manufacturing processes, materials, Mechanical, Microsoft Access, 2000, Microsoft NT server, Microsoft Windows NT Server,\nmicrowave, NEC, network, networks, Novell, Personnel, PLC programming, PLC, plumbing, Power distribution, process control, process\nengineering, Programming, quality, quality control, radio, Record keeping, repairs, repairing, Safety, safety codes, SCADA, Siemens PLC,\nstaffing, supervising, Supervision, surveys, technical support, phones, transmission, troubleshooting, UHF, utilities, validation, VHF, View, Water\nquality, Wonderware, written",
    "tri_grams": "[ENGINEERING SERVICES MANAGER, SERVICES MANAGER Executive, MANAGER Executive Profile, Profile A results, results driven Controls, driven Controls Engineer, Engineer and Project, years of experience, experience in manufacturing, Skilled in Industrial, Automation and Process, strong mechanical design, mechanical design background, ability to lead, lead and motivate, motivate high performance, high performance teams, History of building, systems with improved, functionality and productivity, consistently meeting critical, meeting critical requirements, Skill Highlights Proficient, Proficient in process, engineering and applying, applying process needs, needs to available, technology to improve, improve production availability, availability and uptime, Proficient in process, engineering and applying, applying process needs, needs to available, technology to improve, improve production runablility, runablility and uptime, Professional Experience Engineering, Experience Engineering Services, Engineering Services Manager, Accountable for maintaining, maintaining the efficiency, efficiency and effectiveness, production manufacturing processes, manufacturing processes required, required to manufacture, manufacture a high, high quality product, repeatable and cost, cost effective manner, manner and provide, provide overall customer, overall customer satisfaction, services with provision, design and construction, services both internal, internal and external, Support waste water, waste water operations, operations by providing, providing advanced troubleshooting, troubleshooting on Siemens, Configured WINCC SCADA, WINCC SCADA system, supplies and staffing, staffing are optimized, optimized and maintained, maintained within budget, Developed asset management, asset management software, software to track, history and work, work order tracking, Performed advanced troubleshooting, troubleshooting and PLC, State Primary responsibilities, Primary responsibilities include, responsibilities include supervising, supervising and coordinating, coordinating all electrical, electrical and instrumentation, automation and controls, controls on production, power distribution systems, projects for installation, installation of new, concept to installation, installation and start, Managed large network, network of Allen, CompactLogix and micro, controllers with FactoryTalk, SE human machine, human machine interfaces, Managed the installation, installation and startup, projects over $, HG Molenaar cooker, Buscetto steam peeler, Navatta steam peeler, Bellini diced tomato, diced tomato filling, tomato filling line, Perform advanced troubleshooting, troubleshooting and PLC, electricians and instrument, technicians in advanced, advanced VFD troubleshooting, troubleshooting and configuration, control and applicable, applicable regulations including, regulations including NFPA, including NFPA 70E, 70E and NEC, Responsible to review, review and interpret, interpret proposed designs, specifications for suitability, suitability and initiate, revisions where appropriate, Managed a team, sections to ensure, time project completion, Supervised the mechanical, mechanical and electrical, assembly of equipment, equipment to ensure, ensure that sections, sections are completed, completed on time, time and meet, meet customer specs, teams to insure, insure on time, installation of equipment, equipment at customers, Coordinated with vendors, contractors to complete, complete equipment installation, Developed and administered, administered project budgets, budgets and fiscal, quality control provisions, provisions for projects, Managed the activities, Accountable for projects, involving the construction, construction of new, buildings and facilities, alteration or modification, modification of existing, Performed advanced troubleshooting, troubleshooting and repairs, repairs on production, layout and installation, installation of industrial, PLC and HMI, Bradley SLC500 platform, State Tyco purchased, purchased the facility, Managed the operations, operations and activities, activities of plant, maintenance and engineering, Accountable for compliance, compliance with applicable, state and local, laws and regulations, securing all required, coordinating with local, Maintain a proficiency, proficiency and applied, aspects of plant, plant engineering including, Instrumentation and controls, Codes and standards, piping and plumbing, Compressors and compressed, compressed air systems, handling and storage, design and analysis, Building and life, life safety codes, drawings and specifications, programs and management, Preventive and predictive, predictive maintenance practices, parts and supplies, supplies inventory management, Building and grounds, Administration and Supervision, administration and management, Safety and Health, Air quality control, Water quality control, Solid waste handling, Hazardous materials controls, codes and standards, maintenance and operation, operation of new, new material handling, material handling control, handling control system, Created custom database, database and production, programs with Microsoft, Performed advanced troubleshooting, Converted antiquated Modicon, antiquated Modicon PLC, Modicon PLC control, PLC control system, system to Allen, PLC with Wonderware, Wonderware man machine, man machine interface(HMI, Trained plant maintenance, plant maintenance personnel, personnel on PLC, DC drive troubleshooting, troubleshooting and advanced, advanced electrical controls, electrical controls troubleshooting, State Performed routine, Performed routine electrical, electrical and mechanical, maintenance and emergency, repairs on automated, automated PLC controlled, PLC controlled conveyors, assembly of Apple, Completed PLC logic, PLC logic changes, changes from verbal, verbal or written, instruction and maintained, maintained logic backups, backups with revision, Responsible for repairing, repairing and maintaining, maintaining plastic extrusion, plastic extrusion equipment, production of plastic, bags and stretch, stretch pallet wrap, Performed process troubleshooting, troubleshooting of entire, entire production lines, including programmable logic, programmable logic controllers, inverters and DC, AC and DC, associated control equipment, Maintained all aspects, aspects of plant, plant utilities including, utilities including chillers, compressors and power, Completed electrical installations, installations from blueprints, sketches or verbal, instructions with little, Designed and implemented, implemented a Computerized, Computerized Maintenance Management, Maintenance Management System(CMMS, tracking of maintenance, resources and cost, run a successful, preventive maintenance program, program that greatly, greatly reduced cost, cost of emergency, Instructed other electricians, electricians in maintenance, maintenance and troubleshooting, troubleshooting of AC, AC and DC, drives and P.L.C., Microwave Communications Technician, facility doing repairs, repairs and overhauls, variety of communications, rebuild microwave communications, microwave communications equipment, UHF and VHF, Created a computerized, computerized inventory control, inventory control program, program that greatly, required to perform, perform quarterly inventories, Certificate of Completion, HACCP Online Course, Yuba Community College, Coursework in Business, NEEC Building Operator, Building Operator Certification, High School Diploma, Elk Creek High, Creek High School, Better Process Control, Process Control School, NEEC Building Operator, Building Operator Skills, Operator Skills accounting, design and construction, Microsoft NT server, Microsoft Windows NT, Windows NT Server]",
    "unique_id": "f9d7b440-51a8-484a-a70d-4336633d0156",
    "years": []
}